[Survived] BlockStatement
gleetchy/src/apis/audio.ts:5:38
 
 let audioContext: AudioContext
 
-export const getAudioContext = () => {
-  if (audioContext) {
-    return audioContext
-  }
-
-  const WINDOW = requireWindowWith()
-
-  if (!WINDOW) {
-    throw new Error('Could not access dom')
-  }
-
-  // eslint-disable-next-line @typescript-eslint/no-explicit-any
-  const AudioContext = WINDOW.AudioContext || (WINDOW as any).webkitAudioContext
-
-  if (!AudioContext) {
-    throw new Error('No audio context available')
-  }
-
-  audioContext = new AudioContext()
-
-  return audioContext
-}
+export const getAudioContext = () => {}
 
 export const decodeAudioData = (buffer: ArrayBuffer, context?: AudioContext) =>

[Survived] ConditionalExpression
gleetchy/src/apis/audio.ts:6:7
 let audioContext: AudioContext
 
 export const getAudioContext = () => {
-  if (audioContext) {
+  if (true) {
     return audioContext
   }

[Survived] ConditionalExpression
gleetchy/src/apis/audio.ts:6:7
 let audioContext: AudioContext
 
 export const getAudioContext = () => {
-  if (audioContext) {
+  if (false) {
     return audioContext
   }

[Survived] BooleanLiteral
gleetchy/src/apis/audio.ts:12:7
 
   const WINDOW = requireWindowWith()
 
-  if (!WINDOW) {
+  if (WINDOW) {
     throw new Error('Could not access dom')
   }

[Survived] ConditionalExpression
gleetchy/src/apis/audio.ts:12:7
 
   const WINDOW = requireWindowWith()
 
-  if (!WINDOW) {
+  if (false) {
     throw new Error('Could not access dom')
   }

[Survived] LogicalOperator
gleetchy/src/apis/audio.ts:17:44
   }
 
   // eslint-disable-next-line @typescript-eslint/no-explicit-any
-  const AudioContext = WINDOW.AudioContext || (WINDOW as any).webkitAudioContext
+  const AudioContext = WINDOW.AudioContext && (WINDOW as any).webkitAudioContext
 
   if (!AudioContext) {

[Survived] ConditionalExpression
gleetchy/src/apis/audio.ts:17:24
   }
 
   // eslint-disable-next-line @typescript-eslint/no-explicit-any
-  const AudioContext = WINDOW.AudioContext || (WINDOW as any).webkitAudioContext
+  const AudioContext = true
 
   if (!AudioContext) {

[Survived] ConditionalExpression
gleetchy/src/apis/audio.ts:19:7
   // eslint-disable-next-line @typescript-eslint/no-explicit-any
   const AudioContext = WINDOW.AudioContext || (WINDOW as any).webkitAudioContext
 
-  if (!AudioContext) {
+  if (false) {
     throw new Error('No audio context available')
   }

[Survived] ConditionalExpression
gleetchy/src/apis/audio.ts:19:7
   // eslint-disable-next-line @typescript-eslint/no-explicit-any
   const AudioContext = WINDOW.AudioContext || (WINDOW as any).webkitAudioContext
 
-  if (!AudioContext) {
+  if (true) {
     throw new Error('No audio context available')
   }

[Survived] StringLiteral
gleetchy/src/apis/audio.ts:20:21
   const AudioContext = WINDOW.AudioContext || (WINDOW as any).webkitAudioContext
 
   if (!AudioContext) {
-    throw new Error('No audio context available')
+    throw new Error("")
   }
 

[Survived] ArrowFunction
gleetchy/src/apis/audio.ts:28:32
   return audioContext
 }
 
-export const decodeAudioData = (buffer: ArrayBuffer, context?: AudioContext) =>
-  new Promise<AudioBuffer>((resolve, reject) => {
-    ;(context || getAudioContext()).decodeAudioData(buffer, resolve, reject)
-  })
+export const decodeAudioData = () => undefined
 

[Survived] BlockStatement
gleetchy/src/apis/audio.ts:29:49
 }
 
 export const decodeAudioData = (buffer: ArrayBuffer, context?: AudioContext) =>
-  new Promise<AudioBuffer>((resolve, reject) => {
-    ;(context || getAudioContext()).decodeAudioData(buffer, resolve, reject)
-  })
+  new Promise<AudioBuffer>((resolve, reject) => {})
 

[Survived] ConditionalExpression
gleetchy/src/apis/audio.ts:30:7
 
 export const decodeAudioData = (buffer: ArrayBuffer, context?: AudioContext) =>
   new Promise<AudioBuffer>((resolve, reject) => {
-    ;(context || getAudioContext()).decodeAudioData(buffer, resolve, reject)
+    ;(true).decodeAudioData(buffer, resolve, reject)
   })
 

[Survived] ConditionalExpression
gleetchy/src/apis/audio.ts:30:7
 
 export const decodeAudioData = (buffer: ArrayBuffer, context?: AudioContext) =>
   new Promise<AudioBuffer>((resolve, reject) => {
-    ;(context || getAudioContext()).decodeAudioData(buffer, resolve, reject)
+    ;(false).decodeAudioData(buffer, resolve, reject)
   })
 
