[Survived] BlockStatement
gleetchy/src/apis/file.ts:6:28
 
 let fileInput: HTMLInputElement
 
-const getFileInput = () => {
-  const WINDOW = requireWindowWith(['document.createElement'])
-
-  if (!WINDOW) {
-    return undefined
-  }
-
-  if (!fileInput) {
-    fileInput = WINDOW.document.createElement('input')
-    fileInput.setAttribute('type', 'file')
-    fileInput.setAttribute('accept', '.wav, .mp3, .ogg')
-    WINDOW.document.body.appendChild(fileInput)
-    fileInput.style.display = 'none'
-  }
-
-  return fileInput
-}
+const getFileInput = () => {}
 
 export const loadAudioFiles = () => {

[Survived] StringLiteral
gleetchy/src/apis/file.ts:7:37
 let fileInput: HTMLInputElement
 
 const getFileInput = () => {
-  const WINDOW = requireWindowWith(['document.createElement'])
+  const WINDOW = requireWindowWith([""])
 
   if (!WINDOW) {

[Survived] BlockStatement
gleetchy/src/apis/file.ts:9:16
 const getFileInput = () => {
   const WINDOW = requireWindowWith(['document.createElement'])
 
-  if (!WINDOW) {
-    return undefined
-  }
+  if (!WINDOW) {}
 
   if (!fileInput) {

[Survived] BooleanLiteral
gleetchy/src/apis/file.ts:13:7
     return undefined
   }
 
-  if (!fileInput) {
+  if (fileInput) {
     fileInput = WINDOW.document.createElement('input')
     fileInput.setAttribute('type', 'file')

[Survived] ConditionalExpression
gleetchy/src/apis/file.ts:13:7
     return undefined
   }
 
-  if (!fileInput) {
+  if (true) {
     fileInput = WINDOW.document.createElement('input')
     fileInput.setAttribute('type', 'file')

[Survived] StringLiteral
gleetchy/src/apis/file.ts:14:47
   }
 
   if (!fileInput) {
-    fileInput = WINDOW.document.createElement('input')
+    fileInput = WINDOW.document.createElement("")
     fileInput.setAttribute('type', 'file')
     fileInput.setAttribute('accept', '.wav, .mp3, .ogg')

[Survived] StringLiteral
gleetchy/src/apis/file.ts:16:28
   if (!fileInput) {
     fileInput = WINDOW.document.createElement('input')
     fileInput.setAttribute('type', 'file')
-    fileInput.setAttribute('accept', '.wav, .mp3, .ogg')
+    fileInput.setAttribute("", '.wav, .mp3, .ogg')
     WINDOW.document.body.appendChild(fileInput)
     fileInput.style.display = 'none'

[Survived] StringLiteral
gleetchy/src/apis/file.ts:18:31
     fileInput.setAttribute('type', 'file')
     fileInput.setAttribute('accept', '.wav, .mp3, .ogg')
     WINDOW.document.body.appendChild(fileInput)
-    fileInput.style.display = 'none'
+    fileInput.style.display = ""
   }
 

[Survived] ConditionalExpression
gleetchy/src/apis/file.ts:27:7
 export const loadAudioFiles = () => {
   const input = getFileInput()
 
-  if (!input) {
+  if (true) {
     return Promise.reject(new Error('Cannot load files'))
   }

[Survived] BooleanLiteral
gleetchy/src/apis/file.ts:27:7
 export const loadAudioFiles = () => {
   const input = getFileInput()
 
-  if (!input) {
+  if (input) {
     return Promise.reject(new Error('Cannot load files'))
   }

[Survived] BlockStatement
gleetchy/src/apis/file.ts:31:51
     return Promise.reject(new Error('Cannot load files'))
   }
 
-  return new Promise<File[]>((resolve, reject) => {
-    input.onchange = () => {
-      const { files } = input
-
-      resolve(
-        Array.from(files || []).filter(({ type }) => type.startsWith('audio/')),
-      )
-
-      input.value = ''
-    }
-
-    input.onerror = error => {
-      reject(error)
-
-      input.value = ''
-    }
-
-    input.click()
-  })
+  return new Promise<File[]>((resolve, reject) => {})
 }
 

[Survived] BlockStatement
gleetchy/src/apis/file.ts:32:28
   }
 
   return new Promise<File[]>((resolve, reject) => {
-    input.onchange = () => {
-      const { files } = input
-
-      resolve(
-        Array.from(files || []).filter(({ type }) => type.startsWith('audio/')),
-      )
-
-      input.value = ''
-    }
+    input.onchange = () => {}
 
     input.onerror = error => {

[Survived] ConditionalExpression
gleetchy/src/apis/file.ts:36:20
       const { files } = input
 
       resolve(
-        Array.from(files || []).filter(({ type }) => type.startsWith('audio/')),
+        Array.from(true).filter(({ type }) => type.startsWith('audio/')),
       )
 

[Survived] ArrowFunction
gleetchy/src/apis/file.ts:36:40
       const { files } = input
 
       resolve(
-        Array.from(files || []).filter(({ type }) => type.startsWith('audio/')),
+        Array.from(files || []).filter(() => undefined),
       )
 

[Survived] BlockStatement
gleetchy/src/apis/file.ts:42:30
       input.value = ''
     }
 
-    input.onerror = error => {
-      reject(error)
-
-      input.value = ''
-    }
+    input.onerror = error => {}
 
     input.click()

[Survived] BooleanLiteral
gleetchy/src/apis/file.ts:56:9
   let fileReader: FileReader | null = new FileReader()
 
   return new Promise<AudioFileData>((resolve, reject) => {
-    if (!fileReader) {
+    if (fileReader) {
       reject(new Error('Could not create FileReader'))
       return

[Survived] BlockStatement
gleetchy/src/apis/file.ts:56:22
   let fileReader: FileReader | null = new FileReader()
 
   return new Promise<AudioFileData>((resolve, reject) => {
-    if (!fileReader) {
-      reject(new Error('Could not create FileReader'))
-      return
-    }
+    if (!fileReader) {}
 
     fileReader.onerror = error => {

[Survived] StringLiteral
gleetchy/src/apis/file.ts:57:24
 
   return new Promise<AudioFileData>((resolve, reject) => {
     if (!fileReader) {
-      reject(new Error('Could not create FileReader'))
+      reject(new Error(""))
       return
     }

[Survived] BlockStatement
gleetchy/src/apis/file.ts:61:35
       return
     }
 
-    fileReader.onerror = error => {
-      reject(error)
-      fileReader = null
-    }
+    fileReader.onerror = error => {}
 
     fileReader.onloadend = () => {

[Survived] BlockStatement
gleetchy/src/apis/file.ts:66:34
       fileReader = null
     }
 
-    fileReader.onloadend = () => {
-      if (!fileReader) {
-        reject(new Error('FileReader instance disposed'))
-        return
-      }
-
-      if (!(fileReader.result instanceof ArrayBuffer)) {
-        reject(new Error('Error reading file to ArrayBuffer'))
-        fileReader = null
-        return
-      }
-
-      resolve({
-        buffer: fileReader.result,
-        fileName: file.name,
-        fileType: file.type,
-      })
-
-      fileReader = null
-    }
+    fileReader.onloadend = () => {}
 
     fileReader.readAsArrayBuffer(file)

[Survived] ConditionalExpression
gleetchy/src/apis/file.ts:67:11
     }
 
     fileReader.onloadend = () => {
-      if (!fileReader) {
+      if (false) {
         reject(new Error('FileReader instance disposed'))
         return

[Survived] BlockStatement
gleetchy/src/apis/file.ts:67:24
     }
 
     fileReader.onloadend = () => {
-      if (!fileReader) {
-        reject(new Error('FileReader instance disposed'))
-        return
-      }
+      if (!fileReader) {}
 
       if (!(fileReader.result instanceof ArrayBuffer)) {

[Survived] ConditionalExpression
gleetchy/src/apis/file.ts:72:11
         return
       }
 
-      if (!(fileReader.result instanceof ArrayBuffer)) {
+      if (false) {
         reject(new Error('Error reading file to ArrayBuffer'))
         fileReader = null

[Survived] BooleanLiteral
gleetchy/src/apis/file.ts:72:11
         return
       }
 
-      if (!(fileReader.result instanceof ArrayBuffer)) {
+      if ((fileReader.result instanceof ArrayBuffer)) {
         reject(new Error('Error reading file to ArrayBuffer'))
         fileReader = null

[Survived] StringLiteral
gleetchy/src/apis/file.ts:73:26
       }
 
       if (!(fileReader.result instanceof ArrayBuffer)) {
-        reject(new Error('Error reading file to ArrayBuffer'))
+        reject(new Error(""))
         fileReader = null
         return

[Survived] ObjectLiteral
gleetchy/src/apis/file.ts:78:15
         return
       }
 
-      resolve({
-        buffer: fileReader.result,
-        fileName: file.name,
-        fileType: file.type,
-      })
+      resolve({})
 
       fileReader = null

[Survived] ArrowFunction
gleetchy/src/apis/file.ts:91:39
   })
 }
 
-export const readFilesToArrayBuffer = (files: File[]) =>
-  Promise.all(files.map(readFileToArrayBuffer))
+export const readFilesToArrayBuffer = () => undefined
 
 export const loadAudioFilesToArrayBuffers = () =>

[Survived] ArrowFunction
gleetchy/src/apis/file.ts:94:45
 export const readFilesToArrayBuffer = (files: File[]) =>
   Promise.all(files.map(readFileToArrayBuffer))
 
-export const loadAudioFilesToArrayBuffers = () =>
-  loadAudioFiles().then(readFilesToArrayBuffer)
+export const loadAudioFilesToArrayBuffers = () => undefined
 
