[Survived] BooleanLiteral
src/components/hooks/useFileDropRegion.ts:18:52
   onFiles = noop,
   onNoFiles = noop,
 }: UseFileDropRegionProps) {
-  const [isDropActive, setIsDropActive] = useState(false)
+  const [isDropActive, setIsDropActive] = useState(true)
 
   const eventSetDropActive = useCallback<DragEventHandler>(event => {

[Survived] BlockStatement
src/components/hooks/useFileDropRegion.ts:20:69
 }: UseFileDropRegionProps) {
   const [isDropActive, setIsDropActive] = useState(false)
 
-  const eventSetDropActive = useCallback<DragEventHandler>(event => {
-    cancelReactEvent(event)
-    setIsDropActive(true)
-  }, [])
+  const eventSetDropActive = useCallback<DragEventHandler>(event => {}, [])
 
   const eventSetDropInactive = useCallback<DragEventHandler>(event => {

[Survived] BooleanLiteral
src/components/hooks/useFileDropRegion.ts:22:21
 
   const eventSetDropActive = useCallback<DragEventHandler>(event => {
     cancelReactEvent(event)
-    setIsDropActive(true)
+    setIsDropActive(false)
   }, [])
 

[Survived] BlockStatement
src/components/hooks/useFileDropRegion.ts:25:71
     setIsDropActive(true)
   }, [])
 
-  const eventSetDropInactive = useCallback<DragEventHandler>(event => {
-    cancelReactEvent(event)
-    setIsDropActive(false)
-  }, [])
+  const eventSetDropInactive = useCallback<DragEventHandler>(event => {}, [])
 
   const onDrop = useCallback<DragEventHandler>(

[Survived] BooleanLiteral
src/components/hooks/useFileDropRegion.ts:27:21
 
   const eventSetDropInactive = useCallback<DragEventHandler>(event => {
     cancelReactEvent(event)
-    setIsDropActive(false)
+    setIsDropActive(true)
   }, [])
 

[Survived] BlockStatement
src/components/hooks/useFileDropRegion.ts:31:14
   }, [])
 
   const onDrop = useCallback<DragEventHandler>(
-    event => {
-      const receivable = Array.from(event.dataTransfer.files).filter(fileFilter)
-
-      cancelReactEvent(event)
-      setIsDropActive(false)
-
-      if (receivable.length) onFiles(receivable)
-      else onNoFiles()
-    },
+    event => {},
     [fileFilter, onFiles, onNoFiles],
   )

[Survived] ConditionalExpression
src/components/hooks/useFileDropRegion.ts:37:11
       cancelReactEvent(event)
       setIsDropActive(false)
 
-      if (receivable.length) onFiles(receivable)
+      if (false) onFiles(receivable)
       else onNoFiles()
     },

[Survived] ConditionalExpression
src/components/hooks/useFileDropRegion.ts:37:11
       cancelReactEvent(event)
       setIsDropActive(false)
 
-      if (receivable.length) onFiles(receivable)
+      if (true) onFiles(receivable)
       else onNoFiles()
     },

[Survived] ArrayDeclaration
src/components/hooks/useFileDropRegion.ts:40:5
       if (receivable.length) onFiles(receivable)
       else onNoFiles()
     },
-    [fileFilter, onFiles, onNoFiles],
+    [],
   )
 

[Survived] ArrowFunction
src/components/hooks/useFileDropRegion.ts:44:5
   )
 
   const eventHandlers = useMemo(
-    () => ({
-      onDrop,
-      onDrag: cancelReactEvent,
-      onDragOver: cancelReactEvent,
-      onDragStart: cancelReactEvent,
-      onDragEnter: eventSetDropActive,
-      onDragLeave: eventSetDropInactive,
-      onDragEnd: eventSetDropInactive,
-    }),
+    () => undefined,
     [onDrop, eventSetDropActive, eventSetDropInactive],
   )

[Survived] ArrayDeclaration
src/components/hooks/useFileDropRegion.ts:53:5
       onDragLeave: eventSetDropInactive,
       onDragEnd: eventSetDropInactive,
     }),
-    [onDrop, eventSetDropActive, eventSetDropInactive],
+    [],
   )
 

[Survived] ObjectLiteral
src/components/hooks/useFileDropRegion.ts:56:10
     [onDrop, eventSetDropActive, eventSetDropInactive],
   )
 
-  return { isDropActive, eventHandlers }
+  return {}
 }
 
