[Survived] BlockStatement
gleetchy/src/lib/offlineInstall.ts:13:55
   navigator.serviceWorker
     .register(serviceWorkerUrl, { scope })
     .then(reg => {
-      reg.onupdatefound = function regOnUpdateFound() {
-        const installingWorker = reg.installing
-
-        if (!installingWorker) {
-          return
-        }
-
-        installingWorker.onstatechange = function workerOnStateChange() {
-          switch (installingWorker.state) {
-            case 'installed':
-              if (navigator.serviceWorker.controller) {
-                console.log('New or updated content is available.')
-              } else {
-                console.log('Content is now available offline!')
-              }
-              break
-            case 'redundant':
-              console.log('The installing serviceWorker became redundant.')
-              break
-            default:
-              break
-          }
-        }
-      }
+      reg.onupdatefound = function regOnUpdateFound() {}
     })
     .catch(error => {

[Survived] BlockStatement
gleetchy/src/lib/offlineInstall.ts:16:32
       reg.onupdatefound = function regOnUpdateFound() {
         const installingWorker = reg.installing
 
-        if (!installingWorker) {
-          return
-        }
+        if (!installingWorker) {}
 
         installingWorker.onstatechange = function workerOnStateChange() {

[Survived] ConditionalExpression
gleetchy/src/lib/offlineInstall.ts:16:13
       reg.onupdatefound = function regOnUpdateFound() {
         const installingWorker = reg.installing
 
-        if (!installingWorker) {
+        if (false) {
           return
         }

[Survived] BlockStatement
gleetchy/src/lib/offlineInstall.ts:20:73
           return
         }
 
-        installingWorker.onstatechange = function workerOnStateChange() {
-          switch (installingWorker.state) {
-            case 'installed':
-              if (navigator.serviceWorker.controller) {
-                console.log('New or updated content is available.')
-              } else {
-                console.log('Content is now available offline!')
-              }
-              break
-            case 'redundant':
-              console.log('The installing serviceWorker became redundant.')
-              break
-            default:
-              break
-          }
-        }
+        installingWorker.onstatechange = function workerOnStateChange() {}
       }
     })

[Survived] ConditionalExpression
gleetchy/src/lib/offlineInstall.ts:22:13
 
         installingWorker.onstatechange = function workerOnStateChange() {
           switch (installingWorker.state) {
-            case 'installed':
-              if (navigator.serviceWorker.controller) {
-                console.log('New or updated content is available.')
-              } else {
-                console.log('Content is now available offline!')
-              }
-              break
+            case 'installed':
             case 'redundant':
               console.log('The installing serviceWorker became redundant.')

[Survived] StringLiteral
gleetchy/src/lib/offlineInstall.ts:22:18
 
         installingWorker.onstatechange = function workerOnStateChange() {
           switch (installingWorker.state) {
-            case 'installed':
+            case "":
               if (navigator.serviceWorker.controller) {
                 console.log('New or updated content is available.')

[Survived] BlockStatement
gleetchy/src/lib/offlineInstall.ts:23:55
         installingWorker.onstatechange = function workerOnStateChange() {
           switch (installingWorker.state) {
             case 'installed':
-              if (navigator.serviceWorker.controller) {
-                console.log('New or updated content is available.')
-              } else {
+              if (navigator.serviceWorker.controller) {} else {
                 console.log('Content is now available offline!')
               }

[Survived] ConditionalExpression
gleetchy/src/lib/offlineInstall.ts:23:19
         installingWorker.onstatechange = function workerOnStateChange() {
           switch (installingWorker.state) {
             case 'installed':
-              if (navigator.serviceWorker.controller) {
+              if (true) {
                 console.log('New or updated content is available.')
               } else {

[Survived] BlockStatement
gleetchy/src/lib/offlineInstall.ts:25:22
             case 'installed':
               if (navigator.serviceWorker.controller) {
                 console.log('New or updated content is available.')
-              } else {
-                console.log('Content is now available offline!')
-              }
+              } else {}
               break
             case 'redundant':

[Survived] ConditionalExpression
gleetchy/src/lib/offlineInstall.ts:29:13
                 console.log('Content is now available offline!')
               }
               break
-            case 'redundant':
-              console.log('The installing serviceWorker became redundant.')
-              break
+            case 'redundant':
             default:
               break

[Survived] ConditionalExpression
gleetchy/src/lib/offlineInstall.ts:32:13
             case 'redundant':
               console.log('The installing serviceWorker became redundant.')
               break
-            default:
-              break
+            default:
           }
         }

[Survived] BlockStatement
gleetchy/src/lib/offlineInstall.ts:38:21
         }
       }
     })
-    .catch(error => {
-      console.error('Error during service worker registration:', error)
-    })
+    .catch(error => {})
 }
 

[Survived] LogicalOperator
gleetchy/src/lib/offlineInstall.ts:44:41
 }
 
 const shouldInstall =
-  process.env.NODE_ENV === 'production' &&
+  process.env.NODE_ENV === 'production' ||
   !!requireWindowWith(['navigator.serviceWorker'])
 

[Survived] EqualityOperator
gleetchy/src/lib/offlineInstall.ts:44:24
 }
 
 const shouldInstall =
-  process.env.NODE_ENV === 'production' &&
+  process.env.NODE_ENV !== 'production' &&
   !!requireWindowWith(['navigator.serviceWorker'])
 

[Survived] BooleanLiteral
gleetchy/src/lib/offlineInstall.ts:45:4
 
 const shouldInstall =
   process.env.NODE_ENV === 'production' &&
-  !!requireWindowWith(['navigator.serviceWorker'])
+  !requireWindowWith(['navigator.serviceWorker'])
 
 export default shouldInstall ? offlineInstall : noop
