[Survived] BlockStatement
nodes/audioEffects/delay/createAudioNode.ts:14:6
   wetDryRatio: number,
   wetGainNode: GainNode,
   dryGainNode: GainNode,
-) => {
-  Object.assign(wetGainNode.gain, { value: wetDryRatio })
-  Object.assign(dryGainNode.gain, { value: 1 - wetDryRatio })
-}
+) => {}
 
 export default curry(

[Survived] ArithmeticOperator
nodes/audioEffects/delay/createAudioNode.ts:16:46
   dryGainNode: GainNode,
 ) => {
   Object.assign(wetGainNode.gain, { value: wetDryRatio })
-  Object.assign(dryGainNode.gain, { value: 1 - wetDryRatio })
+  Object.assign(dryGainNode.gain, { value: 1 + wetDryRatio })
 }
 

[Survived] BlockStatement
nodes/audioEffects/delay/createAudioNode.ts:44:42
     })({
       type: nodeType,
 
-      set(newProps: Partial<Props> = {}) {
-        Object.assign(props, newProps)
-
-        delayNode.delayTime.value = props.delayTime
-        updateWetDry(props.wetDryRatio, wetGainNode, dryGainNode)
-      },
+      set(newProps: Partial<Props> = {}) {},
     })
   },
