[Survived] BlockStatement
nodes/audioEffects/eq3/createAudioNode.ts:16:33
     const midNode = audioContext.createBiquadFilter()
     const highNode = audioContext.createBiquadFilter()
 
-    const transferProps = () => {
-      lowNode.gain.value = props.lowGain * 40
-      midNode.gain.value = props.midGain * 40
-      highNode.gain.value = props.highGain * 40
-    }
+    const transferProps = () => {}
 
     lowNode.type = 'lowshelf'

[Survived] ArithmeticOperator
nodes/audioEffects/eq3/createAudioNode.ts:17:42
     const highNode = audioContext.createBiquadFilter()
 
     const transferProps = () => {
-      lowNode.gain.value = props.lowGain * 40
+      lowNode.gain.value = props.lowGain / 40
       midNode.gain.value = props.midGain * 40
       highNode.gain.value = props.highGain * 40

[Survived] ArithmeticOperator
nodes/audioEffects/eq3/createAudioNode.ts:18:42
 
     const transferProps = () => {
       lowNode.gain.value = props.lowGain * 40
-      midNode.gain.value = props.midGain * 40
+      midNode.gain.value = props.midGain / 40
       highNode.gain.value = props.highGain * 40
     }

[Survived] ArithmeticOperator
nodes/audioEffects/eq3/createAudioNode.ts:19:44
     const transferProps = () => {
       lowNode.gain.value = props.lowGain * 40
       midNode.gain.value = props.midGain * 40
-      highNode.gain.value = props.highGain * 40
+      highNode.gain.value = props.highGain / 40
     }
 

[Survived] StringLiteral
nodes/audioEffects/eq3/createAudioNode.ts:25:20
     lowNode.type = 'lowshelf'
     lowNode.frequency.value = 320
 
-    midNode.type = 'peaking'
+    midNode.type = ""
     midNode.frequency.value = 1000
     midNode.Q.value = 0.5

[Survived] BlockStatement
nodes/audioEffects/eq3/createAudioNode.ts:43:42
     })({
       type: nodeType,
 
-      set(newProps: Partial<Props> = {}) {
-        Object.assign(props, newProps)
-        transferProps()
-      },
+      set(newProps: Partial<Props> = {}) {},
     })
   },
