[Survived] ObjectLiteral
nodes/audioEffects/eq3/nodeProps.ts:1:43
-export const defaultProps = Object.freeze({
-  highGain: 0,
-  lowGain: 0,
-  midGain: 0,
-})
+export const defaultProps = Object.freeze({})
 
 export type Props = Mutable<typeof defaultProps>
