[Survived] ObjectLiteral
nodes/audioEffects/reverb/createAudioNode.ts:16:35
   wetGainNode: GainNode,
   dryGainNode: GainNode,
 ) => {
-  Object.assign(wetGainNode.gain, { value: wetDryRatio })
+  Object.assign(wetGainNode.gain, {})
   Object.assign(dryGainNode.gain, { value: 1 - wetDryRatio })
 }

[Survived] BlockStatement
nodes/audioEffects/reverb/createAudioNode.ts:20:72
   Object.assign(dryGainNode.gain, { value: 1 - wetDryRatio })
 }
 
-const loadImpulse = async (audioContext: AudioContext, url: string) => {
-  const response = await fetch(url)
-  const arrayBuffer = await response.arrayBuffer()
-
-  return decodeAudioData(arrayBuffer, audioContext)
-}
+const loadImpulse = async (audioContext: AudioContext, url: string) => {}
 
 export default curry(

[Survived] BlockStatement
nodes/audioEffects/reverb/createAudioNode.ts:44:61
 
     updateWetDry(props.wetDryRatio, wetGainNode, dryGainNode)
 
-    loadImpulse(audioContext, reverbImpulse).then(buffer => {
-      reverbNode.buffer = buffer
-    })
+    loadImpulse(audioContext, reverbImpulse).then(buffer => {})
 
     return connectable({

[Survived] ObjectLiteral
nodes/audioEffects/reverb/createAudioNode.ts:48:24
       reverbNode.buffer = buffer
     })
 
-    return connectable({
-      getInNode: always(inNode),
-      getOutNode: always(outNode),
-    })({
+    return connectable({})({
       type: nodeType,
 

[Survived] BlockStatement
nodes/audioEffects/reverb/createAudioNode.ts:54:42
     })({
       type: nodeType,
 
-      set(newProps: Partial<Props> = {}) {
-        Object.assign(props, newProps)
-        updateWetDry(props.wetDryRatio, wetGainNode, dryGainNode)
-      },
+      set(newProps: Partial<Props> = {}) {},
     })
   },
