[Survived] ObjectLiteral
nodes/instruments/loop/createAudioNode.ts:12:19
 
 export default curry(
   (audioContext: AudioContext, initProps: Partial<Props>): InstrumentNode => {
-    const props = { ...defaultProps, ...initProps }
+    const props = {}
     const eq3Node = createEq3Node(audioContext, {
       lowGain: props.lowGain,

[Survived] BooleanLiteral
nodes/instruments/loop/createAudioNode.ts:21:21
     const gainNode = audioContext.createGain()
     const getGainNode = always(gainNode)
 
-    let isPlaying = false
+    let isPlaying = true
     let bufferSourceNode: AudioBufferSourceNode | null = null
 

[Survived] BlockStatement
nodes/instruments/loop/createAudioNode.ts:27:51
     eq3Node.connect(gainNode)
     gainNode.gain.value = props.gain
 
-    const transferPropsToBufferSourceNode = () => {
-      if (!bufferSourceNode) {
-        return
-      }
-
-      const { audioBuffer } = props
-
-      if (!audioBuffer) {
-        return
-      }
-
-      const { duration } = audioBuffer
-
-      bufferSourceNode.loopStart = props.loopStart * duration
-      bufferSourceNode.loopEnd = props.loopEnd * duration
-      bufferSourceNode.playbackRate.value = props.playbackRate
-    }
+    const transferPropsToBufferSourceNode = () => {}
 
     const removeBufferSourceNode = () => {

[Survived] ConditionalExpression
nodes/instruments/loop/createAudioNode.ts:28:11
     gainNode.gain.value = props.gain
 
     const transferPropsToBufferSourceNode = () => {
-      if (!bufferSourceNode) {
+      if (false) {
         return
       }

[Survived] BooleanLiteral
nodes/instruments/loop/createAudioNode.ts:28:11
     gainNode.gain.value = props.gain
 
     const transferPropsToBufferSourceNode = () => {
-      if (!bufferSourceNode) {
+      if (bufferSourceNode) {
         return
       }

[Survived] BlockStatement
nodes/instruments/loop/createAudioNode.ts:34:25
 
       const { audioBuffer } = props
 
-      if (!audioBuffer) {
-        return
-      }
+      if (!audioBuffer) {}
 
       const { duration } = audioBuffer

[Survived] ConditionalExpression
nodes/instruments/loop/createAudioNode.ts:34:11
 
       const { audioBuffer } = props
 
-      if (!audioBuffer) {
+      if (true) {
         return
       }

[Survived] ArithmeticOperator
nodes/instruments/loop/createAudioNode.ts:40:52
 
       const { duration } = audioBuffer
 
-      bufferSourceNode.loopStart = props.loopStart * duration
+      bufferSourceNode.loopStart = props.loopStart / duration
       bufferSourceNode.loopEnd = props.loopEnd * duration
       bufferSourceNode.playbackRate.value = props.playbackRate

[Survived] ArithmeticOperator
nodes/instruments/loop/createAudioNode.ts:41:48
       const { duration } = audioBuffer
 
       bufferSourceNode.loopStart = props.loopStart * duration
-      bufferSourceNode.loopEnd = props.loopEnd * duration
+      bufferSourceNode.loopEnd = props.loopEnd / duration
       bufferSourceNode.playbackRate.value = props.playbackRate
     }

[Survived] BlockStatement
nodes/instruments/loop/createAudioNode.ts:45:42
       bufferSourceNode.playbackRate.value = props.playbackRate
     }
 
-    const removeBufferSourceNode = () => {
-      if (!bufferSourceNode) {
-        return
-      }
-
-      bufferSourceNode.disconnect(eq3Node.getInNode())
-      bufferSourceNode = null
-    }
+    const removeBufferSourceNode = () => {}
 
     const replaceBufferSourceNode = () => {

[Survived] ConditionalExpression
nodes/instruments/loop/createAudioNode.ts:46:11
     }
 
     const removeBufferSourceNode = () => {
-      if (!bufferSourceNode) {
+      if (true) {
         return
       }

[Survived] BlockStatement
nodes/instruments/loop/createAudioNode.ts:46:30
     }
 
     const removeBufferSourceNode = () => {
-      if (!bufferSourceNode) {
-        return
-      }
+      if (!bufferSourceNode) {}
 
       bufferSourceNode.disconnect(eq3Node.getInNode())

[Survived] BlockStatement
nodes/instruments/loop/createAudioNode.ts:54:43
       bufferSourceNode = null
     }
 
-    const replaceBufferSourceNode = () => {
-      removeBufferSourceNode()
-
-      const { loopStart, audioBuffer } = props
-
-      if (!audioBuffer) {
-        return
-      }
-
-      bufferSourceNode = audioContext.createBufferSource()
-      bufferSourceNode.buffer = audioBuffer
-      bufferSourceNode.loop = true
-
-      transferPropsToBufferSourceNode()
-
-      bufferSourceNode.connect(eq3Node.getInNode())
-
-      if (isPlaying) {
-        bufferSourceNode.start(0, loopStart * audioBuffer.duration)
-      }
-    }
+    const replaceBufferSourceNode = () => {}
 
     return connectable<Props, InstrumentNode>({

[Survived] ConditionalExpression
nodes/instruments/loop/createAudioNode.ts:59:11
 
       const { loopStart, audioBuffer } = props
 
-      if (!audioBuffer) {
+      if (false) {
         return
       }

[Survived] BooleanLiteral
nodes/instruments/loop/createAudioNode.ts:59:11
 
       const { loopStart, audioBuffer } = props
 
-      if (!audioBuffer) {
+      if (audioBuffer) {
         return
       }

[Survived] BooleanLiteral
nodes/instruments/loop/createAudioNode.ts:65:31
 
       bufferSourceNode = audioContext.createBufferSource()
       bufferSourceNode.buffer = audioBuffer
-      bufferSourceNode.loop = true
+      bufferSourceNode.loop = false
 
       transferPropsToBufferSourceNode()

[Survived] ConditionalExpression
nodes/instruments/loop/createAudioNode.ts:71:11
 
       bufferSourceNode.connect(eq3Node.getInNode())
 
-      if (isPlaying) {
+      if (true) {
         bufferSourceNode.start(0, loopStart * audioBuffer.duration)
       }

[Survived] BlockStatement
nodes/instruments/loop/createAudioNode.ts:71:22
 
       bufferSourceNode.connect(eq3Node.getInNode())
 
-      if (isPlaying) {
-        bufferSourceNode.start(0, loopStart * audioBuffer.duration)
-      }
+      if (isPlaying) {}
     }
 

[Survived] ArithmeticOperator
nodes/instruments/loop/createAudioNode.ts:72:45
       bufferSourceNode.connect(eq3Node.getInNode())
 
       if (isPlaying) {
-        bufferSourceNode.start(0, loopStart * audioBuffer.duration)
+        bufferSourceNode.start(0, loopStart / audioBuffer.duration)
       }
     }

[Survived] BlockStatement
nodes/instruments/loop/createAudioNode.ts:82:14
     })({
       type: nodeType,
 
-      play() {
-        if (isPlaying) {
-          return
-        }
-
-        isPlaying = true
-        replaceBufferSourceNode()
-      },
+      play() {},
 
       stop() {

[Survived] ConditionalExpression
nodes/instruments/loop/createAudioNode.ts:83:13
       type: nodeType,
 
       play() {
-        if (isPlaying) {
+        if (true) {
           return
         }

[Survived] ConditionalExpression
nodes/instruments/loop/createAudioNode.ts:83:13
       type: nodeType,
 
       play() {
-        if (isPlaying) {
+        if (false) {
           return
         }

[Survived] BooleanLiteral
nodes/instruments/loop/createAudioNode.ts:87:21
           return
         }
 
-        isPlaying = true
+        isPlaying = false
         replaceBufferSourceNode()
       },

[Survived] BlockStatement
nodes/instruments/loop/createAudioNode.ts:91:14
         replaceBufferSourceNode()
       },
 
-      stop() {
-        if (!isPlaying) {
-          return
-        }
-
-        isPlaying = false
-        removeBufferSourceNode()
-      },
+      stop() {},
 
       set(newProps: Partial<Props> = {}) {

[Survived] BlockStatement
nodes/instruments/loop/createAudioNode.ts:92:25
       },
 
       stop() {
-        if (!isPlaying) {
-          return
-        }
+        if (!isPlaying) {}
 
         isPlaying = false

[Survived] ConditionalExpression
nodes/instruments/loop/createAudioNode.ts:92:13
       },
 
       stop() {
-        if (!isPlaying) {
+        if (false) {
           return
         }

[Survived] BooleanLiteral
nodes/instruments/loop/createAudioNode.ts:96:21
           return
         }
 
-        isPlaying = false
+        isPlaying = true
         removeBufferSourceNode()
       },

[Survived] ObjectLiteral
nodes/instruments/loop/createAudioNode.ts:101:27
       },
 
       set(newProps: Partial<Props> = {}) {
-        const prevProps = { ...props }
+        const prevProps = {}
 
         Object.assign(props, newProps)

[Survived] ObjectLiteral
nodes/instruments/loop/createAudioNode.ts:114:21
           highGain,
         } = props
 
-        eq3Node.set({ midGain, lowGain, highGain })
+        eq3Node.set({})
         gainNode.gain.value = gain
 

[Survived] LogicalOperator
nodes/instruments/loop/createAudioNode.ts:118:49
         gainNode.gain.value = gain
 
         if (
-          prevProps.audioBuffer !== audioBuffer ||
+          prevProps.audioBuffer !== audioBuffer &&
           prevProps.loopStart !== loopStart
         ) {

[Survived] ConditionalExpression
nodes/instruments/loop/createAudioNode.ts:118:11
         gainNode.gain.value = gain
 
         if (
-          prevProps.audioBuffer !== audioBuffer ||
-          prevProps.loopStart !== loopStart
+          false
         ) {
           replaceBufferSourceNode()

[Survived] EqualityOperator
nodes/instruments/loop/createAudioNode.ts:119:31
 
         if (
           prevProps.audioBuffer !== audioBuffer ||
-          prevProps.loopStart !== loopStart
+          prevProps.loopStart === loopStart
         ) {
           replaceBufferSourceNode()

[Survived] BlockStatement
nodes/instruments/loop/createAudioNode.ts:120:11
         if (
           prevProps.audioBuffer !== audioBuffer ||
           prevProps.loopStart !== loopStart
-        ) {
-          replaceBufferSourceNode()
-        } else if (audioBuffer && bufferSourceNode) {
+        ) {} else if (audioBuffer && bufferSourceNode) {
           transferPropsToBufferSourceNode()
         } else if (!audioBuffer) {

[Survived] BlockStatement
nodes/instruments/loop/createAudioNode.ts:122:53
           prevProps.loopStart !== loopStart
         ) {
           replaceBufferSourceNode()
-        } else if (audioBuffer && bufferSourceNode) {
-          transferPropsToBufferSourceNode()
-        } else if (!audioBuffer) {
+        } else if (audioBuffer && bufferSourceNode) {} else if (!audioBuffer) {
           removeBufferSourceNode()
         }

[Survived] ConditionalExpression
nodes/instruments/loop/createAudioNode.ts:122:20
           prevProps.loopStart !== loopStart
         ) {
           replaceBufferSourceNode()
-        } else if (audioBuffer && bufferSourceNode) {
+        } else if (false) {
           transferPropsToBufferSourceNode()
         } else if (!audioBuffer) {

[Survived] BlockStatement
nodes/instruments/loop/createAudioNode.ts:124:34
           replaceBufferSourceNode()
         } else if (audioBuffer && bufferSourceNode) {
           transferPropsToBufferSourceNode()
-        } else if (!audioBuffer) {
-          removeBufferSourceNode()
-        }
+        } else if (!audioBuffer) {}
       },
     })

[Survived] BooleanLiteral
nodes/instruments/loop/createAudioNode.ts:124:20
           replaceBufferSourceNode()
         } else if (audioBuffer && bufferSourceNode) {
           transferPropsToBufferSourceNode()
-        } else if (!audioBuffer) {
+        } else if (audioBuffer) {
           removeBufferSourceNode()
         }
