[Survived] StringLiteral
nodes/instruments/loop/nodeProps.ts:7:13
   ...eq3DefaultProps,
   audioBuffer: undefined,
   fileName: '',
-  fileType: '',
+  fileType: "Stryker was here!",
   gain: 0.5,
   loopEnd: 1,
