[Survived] ArrowFunction
src/state/audioEngine/actions.ts:3:45
 import { AudioEngineClearEventsAction } from './types'
 
-export const clearAudioEngineEventsAction = (): AudioEngineClearEventsAction => ({
-  type: 'AUDIO_ENGINE_CLEAR_EVENTS',
-})
+export const clearAudioEngineEventsAction = () => undefined
 

[Survived] ObjectLiteral
src/state/audioEngine/actions.ts:3:82
 import { AudioEngineClearEventsAction } from './types'
 
-export const clearAudioEngineEventsAction = (): AudioEngineClearEventsAction => ({
-  type: 'AUDIO_ENGINE_CLEAR_EVENTS',
-})
+export const clearAudioEngineEventsAction = (): AudioEngineClearEventsAction => ({})
 
