[Survived] ArrayDeclaration
src/state/audioEngine/reducer.ts:14:32
   events: AudioEngineEvent[]
 }
 
-const defaultState = { events: [] }
+const defaultState = { events: ["Stryker was here"] }
 
 const audioEngineReducer: Reducer<

[Survived] ObjectLiteral
src/state/audioEngine/reducer.ts:14:22
   events: AudioEngineEvent[]
 }
 
-const defaultState = { events: [] }
+const defaultState = {}
 
 const audioEngineReducer: Reducer<

[Survived] BlockStatement
src/state/audioEngine/reducer.ts:23:39
   | ConnectionsAction
   | GlobalPlaybackAction
   | AudioEngineAction
-> = (state = defaultState, action) => {
-  switch (action.type) {
-    case 'AUDIO_NODE_ADD':
-    case 'AUDIO_NODE_REMOVE':
-    case 'AUDIO_NODE_UPDATE_AUDIO_PROPS':
-    case 'CONNECTION_ADD':
-    case 'CONNECTION_REMOVE':
-    case 'AUDIO_FILE_DECODE_COMPLETE':
-    case 'GLOBAL_PLAYBACK_START':
-    case 'GLOBAL_PLAYBACK_STOP': {
-      return produce(state, draftState => {
-        draftState.events.push(action as AudioEngineEvent)
-      })
-    }
-    case 'AUDIO_ENGINE_CLEAR_EVENTS':
-      return produce(state, draftState => {
-        if (draftState.events.length) draftState.events = []
-      })
-    default:
-      return state
-  }
-}
+> = (state = defaultState, action) => {}
 
 export default audioEngineReducer

[Survived] StringLiteral
src/state/audioEngine/reducer.ts:27:10
   switch (action.type) {
     case 'AUDIO_NODE_ADD':
     case 'AUDIO_NODE_REMOVE':
-    case 'AUDIO_NODE_UPDATE_AUDIO_PROPS':
+    case "":
     case 'CONNECTION_ADD':
     case 'CONNECTION_REMOVE':

[Survived] StringLiteral
src/state/audioEngine/reducer.ts:28:10
     case 'AUDIO_NODE_ADD':
     case 'AUDIO_NODE_REMOVE':
     case 'AUDIO_NODE_UPDATE_AUDIO_PROPS':
-    case 'CONNECTION_ADD':
+    case "":
     case 'CONNECTION_REMOVE':
     case 'AUDIO_FILE_DECODE_COMPLETE':

[Survived] StringLiteral
src/state/audioEngine/reducer.ts:29:10
     case 'AUDIO_NODE_REMOVE':
     case 'AUDIO_NODE_UPDATE_AUDIO_PROPS':
     case 'CONNECTION_ADD':
-    case 'CONNECTION_REMOVE':
+    case "":
     case 'AUDIO_FILE_DECODE_COMPLETE':
     case 'GLOBAL_PLAYBACK_START':

[Survived] StringLiteral
src/state/audioEngine/reducer.ts:30:10
     case 'AUDIO_NODE_UPDATE_AUDIO_PROPS':
     case 'CONNECTION_ADD':
     case 'CONNECTION_REMOVE':
-    case 'AUDIO_FILE_DECODE_COMPLETE':
+    case "":
     case 'GLOBAL_PLAYBACK_START':
     case 'GLOBAL_PLAYBACK_STOP': {

[Survived] BlockStatement
src/state/audioEngine/reducer.ts:32:34
     case 'CONNECTION_REMOVE':
     case 'AUDIO_FILE_DECODE_COMPLETE':
     case 'GLOBAL_PLAYBACK_START':
-    case 'GLOBAL_PLAYBACK_STOP': {
-      return produce(state, draftState => {
-        draftState.events.push(action as AudioEngineEvent)
-      })
-    }
+    case 'GLOBAL_PLAYBACK_STOP': {}
     case 'AUDIO_ENGINE_CLEAR_EVENTS':
       return produce(state, draftState => {

[Survived] ConditionalExpression
src/state/audioEngine/reducer.ts:32:5
     case 'CONNECTION_REMOVE':
     case 'AUDIO_FILE_DECODE_COMPLETE':
     case 'GLOBAL_PLAYBACK_START':
-    case 'GLOBAL_PLAYBACK_STOP': {
-      return produce(state, draftState => {
-        draftState.events.push(action as AudioEngineEvent)
-      })
-    }
+    case 'GLOBAL_PLAYBACK_STOP':
     case 'AUDIO_ENGINE_CLEAR_EVENTS':
       return produce(state, draftState => {

[Survived] BlockStatement
src/state/audioEngine/reducer.ts:33:43
     case 'AUDIO_FILE_DECODE_COMPLETE':
     case 'GLOBAL_PLAYBACK_START':
     case 'GLOBAL_PLAYBACK_STOP': {
-      return produce(state, draftState => {
-        draftState.events.push(action as AudioEngineEvent)
-      })
+      return produce(state, draftState => {})
     }
     case 'AUDIO_ENGINE_CLEAR_EVENTS':

[Survived] ConditionalExpression
src/state/audioEngine/reducer.ts:37:5
         draftState.events.push(action as AudioEngineEvent)
       })
     }
-    case 'AUDIO_ENGINE_CLEAR_EVENTS':
-      return produce(state, draftState => {
-        if (draftState.events.length) draftState.events = []
-      })
+    case 'AUDIO_ENGINE_CLEAR_EVENTS':
     default:
       return state

[Survived] BlockStatement
src/state/audioEngine/reducer.ts:38:43
       })
     }
     case 'AUDIO_ENGINE_CLEAR_EVENTS':
-      return produce(state, draftState => {
-        if (draftState.events.length) draftState.events = []
-      })
+      return produce(state, draftState => {})
     default:
       return state

[Survived] ConditionalExpression
src/state/audioEngine/reducer.ts:39:13
     }
     case 'AUDIO_ENGINE_CLEAR_EVENTS':
       return produce(state, draftState => {
-        if (draftState.events.length) draftState.events = []
+        if (true) draftState.events = []
       })
     default:

[Survived] ConditionalExpression
src/state/audioEngine/reducer.ts:39:13
     }
     case 'AUDIO_ENGINE_CLEAR_EVENTS':
       return produce(state, draftState => {
-        if (draftState.events.length) draftState.events = []
+        if (false) draftState.events = []
       })
     default:

[Survived] ConditionalExpression
src/state/audioEngine/reducer.ts:41:5
       return produce(state, draftState => {
         if (draftState.events.length) draftState.events = []
       })
-    default:
-      return state
+    default:
   }
 }
