[Survived] ArrowFunction
src/state/audioEngine/selectors.ts:5:34
 
 import { ApplicationState } from '~/state/configureStore'
 
-const audioEngineStateSelector = (state: ApplicationState) => state.audioEngine
+const audioEngineStateSelector = () => undefined
 
 export const audioEngineEventsSelector = createSelector(

[Survived] ArrowFunction
src/state/audioEngine/selectors.ts:9:3
 
 export const audioEngineEventsSelector = createSelector(
   audioEngineStateSelector,
-  ({ events }) => events,
+  () => undefined,
 )
 
