[Survived] BlockStatement
src/state/audioFiles/actions.ts:24:6
   dispatch: Dispatch,
   id: string,
   file: AudioFileData,
-) => {
-  try {
-    dispatch<AudioFileDecodeStartAction>({
-      payload: { id },
-      type: 'AUDIO_FILE_DECODE_START',
-    })
-
-    const audioBuffer = await decodeAudioData(file.buffer)
-
-    dispatch<AudioFileDecodeCompleteAction>({
-      payload: {
-        file: { ...pick(['fileName', 'fileType'], file), audioBuffer },
-        id,
-      },
-      type: 'AUDIO_FILE_DECODE_COMPLETE',
-    })
-  } catch (error) {
-    dispatch<AudioFileDecodeErrorAction>({
-      payload: { id, error },
-      type: 'AUDIO_FILE_DECODE_ERROR',
-    })
-  }
-}
+) => {}
 
 export const selectAudioFileAction = (id: string) => async (

[Survived] BlockStatement
src/state/audioFiles/actions.ts:25:7
   id: string,
   file: AudioFileData,
 ) => {
-  try {
-    dispatch<AudioFileDecodeStartAction>({
-      payload: { id },
-      type: 'AUDIO_FILE_DECODE_START',
-    })
-
-    const audioBuffer = await decodeAudioData(file.buffer)
-
-    dispatch<AudioFileDecodeCompleteAction>({
-      payload: {
-        file: { ...pick(['fileName', 'fileType'], file), audioBuffer },
-        id,
-      },
-      type: 'AUDIO_FILE_DECODE_COMPLETE',
-    })
-  } catch (error) {
+  try {} catch (error) {
     dispatch<AudioFileDecodeErrorAction>({
       payload: { id, error },

[Survived] ObjectLiteral
src/state/audioFiles/actions.ts:26:42
   file: AudioFileData,
 ) => {
   try {
-    dispatch<AudioFileDecodeStartAction>({
-      payload: { id },
-      type: 'AUDIO_FILE_DECODE_START',
-    })
+    dispatch<AudioFileDecodeStartAction>({})
 
     const audioBuffer = await decodeAudioData(file.buffer)

[Survived] ObjectLiteral
src/state/audioFiles/actions.ts:35:15
 
     dispatch<AudioFileDecodeCompleteAction>({
       payload: {
-        file: { ...pick(['fileName', 'fileType'], file), audioBuffer },
+        file: {},
         id,
       },

[Survived] StringLiteral
src/state/audioFiles/actions.ts:35:26
 
     dispatch<AudioFileDecodeCompleteAction>({
       payload: {
-        file: { ...pick(['fileName', 'fileType'], file), audioBuffer },
+        file: { ...pick(["", 'fileType'], file), audioBuffer },
         id,
       },

[Survived] BlockStatement
src/state/audioFiles/actions.ts:40:19
       },
       type: 'AUDIO_FILE_DECODE_COMPLETE',
     })
-  } catch (error) {
-    dispatch<AudioFileDecodeErrorAction>({
-      payload: { id, error },
-      type: 'AUDIO_FILE_DECODE_ERROR',
-    })
-  }
+  } catch (error) {}
 }
 

[Survived] BlockStatement
src/state/audioFiles/actions.ts:58:7
 
   let file: AudioFileData | undefined
 
-  try {
-    file = head(await loadAudioFilesToArrayBuffers())
-
-    if (!file) {
-      throw new Error('No file loaded')
-    }
-
-    dispatch<AudioFileLoadCompleteAction>({
-      payload: { id, file },
-      type: 'AUDIO_FILE_LOAD_COMPLETE',
-    })
-
-    decodeFileBuffer(dispatch, id, file)
-  } catch (error) {
+  try {} catch (error) {
     dispatch<AudioFileLoadErrorAction>({
       payload: { id, error },

[Survived] ConditionalExpression
src/state/audioFiles/actions.ts:61:9
   try {
     file = head(await loadAudioFilesToArrayBuffers())
 
-    if (!file) {
+    if (false) {
       throw new Error('No file loaded')
     }

[Survived] BooleanLiteral
src/state/audioFiles/actions.ts:61:9
   try {
     file = head(await loadAudioFilesToArrayBuffers())
 
-    if (!file) {
+    if (file) {
       throw new Error('No file loaded')
     }

[Survived] StringLiteral
src/state/audioFiles/actions.ts:62:23
     file = head(await loadAudioFilesToArrayBuffers())
 
     if (!file) {
-      throw new Error('No file loaded')
+      throw new Error("")
     }
 

[Survived] ObjectLiteral
src/state/audioFiles/actions.ts:66:16
     }
 
     dispatch<AudioFileLoadCompleteAction>({
-      payload: { id, file },
+      payload: {},
       type: 'AUDIO_FILE_LOAD_COMPLETE',
     })

[Survived] BlockStatement
src/state/audioFiles/actions.ts:71:19
     })
 
     decodeFileBuffer(dispatch, id, file)
-  } catch (error) {
-    dispatch<AudioFileLoadErrorAction>({
-      payload: { id, error },
-      type: 'AUDIO_FILE_LOAD_ERROR',
-    })
-  }
+  } catch (error) {}
 }
 

[Survived] ObjectLiteral
src/state/audioFiles/actions.ts:73:16
     decodeFileBuffer(dispatch, id, file)
   } catch (error) {
     dispatch<AudioFileLoadErrorAction>({
-      payload: { id, error },
+      payload: {},
       type: 'AUDIO_FILE_LOAD_ERROR',
     })

[Survived] StringLiteral
src/state/audioFiles/actions.ts:74:13
   } catch (error) {
     dispatch<AudioFileLoadErrorAction>({
       payload: { id, error },
-      type: 'AUDIO_FILE_LOAD_ERROR',
+      type: "",
     })
   }

[Survived] BlockStatement
src/state/audioFiles/actions.ts:81:6
 
 export const receiveAudioFileAction = (id: string, file: File) => async (
   dispatch: Dispatch,
-) => {
-  dispatch<AudioFileLoadStartAction>({
-    payload: { id },
-    type: 'AUDIO_FILE_LOAD_START',
-  })
-
-  let fileData: AudioFileData | undefined
-
-  try {
-    fileData = await readFileToArrayBuffer(file)
-
-    dispatch<AudioFileLoadCompleteAction>({
-      payload: { id, file: fileData },
-      type: 'AUDIO_FILE_LOAD_COMPLETE',
-    })
-
-    decodeFileBuffer(dispatch, id, fileData)
-  } catch (error) {
-    dispatch<AudioFileLoadErrorAction>({
-      payload: { id, error },
-      type: 'AUDIO_FILE_LOAD_ERROR',
-    })
-  }
-}
+) => {}
 

[Survived] BlockStatement
src/state/audioFiles/actions.ts:89:7
 
   let fileData: AudioFileData | undefined
 
-  try {
-    fileData = await readFileToArrayBuffer(file)
-
-    dispatch<AudioFileLoadCompleteAction>({
-      payload: { id, file: fileData },
-      type: 'AUDIO_FILE_LOAD_COMPLETE',
-    })
-
-    decodeFileBuffer(dispatch, id, fileData)
-  } catch (error) {
+  try {} catch (error) {
     dispatch<AudioFileLoadErrorAction>({
       payload: { id, error },

[Survived] ObjectLiteral
src/state/audioFiles/actions.ts:93:16
     fileData = await readFileToArrayBuffer(file)
 
     dispatch<AudioFileLoadCompleteAction>({
-      payload: { id, file: fileData },
+      payload: {},
       type: 'AUDIO_FILE_LOAD_COMPLETE',
     })

[Survived] BlockStatement
src/state/audioFiles/actions.ts:98:19
     })
 
     decodeFileBuffer(dispatch, id, fileData)
-  } catch (error) {
-    dispatch<AudioFileLoadErrorAction>({
-      payload: { id, error },
-      type: 'AUDIO_FILE_LOAD_ERROR',
-    })
-  }
+  } catch (error) {}
 }
 
