[Survived] ArrayDeclaration
src/state/audioFiles/reducer.ts:21:15
   decodingIds: [],
   files: {},
   loadErrors: {},
-  loadingIds: [],
+  loadingIds: ["Stryker was here"],
 }
 

[Survived] ConditionalExpression
src/state/audioFiles/reducer.ts:29:5
   action,
 ) => {
   switch (action.type) {
-    case 'AUDIO_FILE_LOAD_START':
-      return {
-        ...state,
-        loadErrors: omit([action.payload.id], state.loadErrors),
-        loadingIds: without([action.payload.id], state.loadingIds).concat(
-          action.payload.id,
-        ),
-      }
+    case 'AUDIO_FILE_LOAD_START':
     case 'AUDIO_FILE_LOAD_COMPLETE':
       return {

[Survived] ArrayDeclaration
src/state/audioFiles/reducer.ts:32:26
     case 'AUDIO_FILE_LOAD_START':
       return {
         ...state,
-        loadErrors: omit([action.payload.id], state.loadErrors),
+        loadErrors: omit([], state.loadErrors),
         loadingIds: without([action.payload.id], state.loadingIds).concat(
           action.payload.id,

[Survived] ArrayDeclaration
src/state/audioFiles/reducer.ts:33:29
       return {
         ...state,
         loadErrors: omit([action.payload.id], state.loadErrors),
-        loadingIds: without([action.payload.id], state.loadingIds).concat(
+        loadingIds: without([], state.loadingIds).concat(
           action.payload.id,
         ),

[Survived] ConditionalExpression
src/state/audioFiles/reducer.ts:37:5
           action.payload.id,
         ),
       }
-    case 'AUDIO_FILE_LOAD_COMPLETE':
-      return {
-        ...state,
-        files: {
-          ...state.files,
-          [action.payload.id]: {
-            ...(state.files[action.payload.id] || {}),
-            ...omit(['buffer'], action.payload.file),
-          },
-        },
-        loadErrors: omit([action.payload.id], state.loadErrors),
-        loadingIds: without([action.payload.id], state.loadingIds),
-      }
+    case 'AUDIO_FILE_LOAD_COMPLETE':
     case 'AUDIO_FILE_LOAD_ERROR':
       return {

[Survived] ObjectLiteral
src/state/audioFiles/reducer.ts:40:16
     case 'AUDIO_FILE_LOAD_COMPLETE':
       return {
         ...state,
-        files: {
-          ...state.files,
-          [action.payload.id]: {
-            ...(state.files[action.payload.id] || {}),
-            ...omit(['buffer'], action.payload.file),
-          },
-        },
+        files: {},
         loadErrors: omit([action.payload.id], state.loadErrors),
         loadingIds: without([action.payload.id], state.loadingIds),

[Survived] ObjectLiteral
src/state/audioFiles/reducer.ts:42:32
         ...state,
         files: {
           ...state.files,
-          [action.payload.id]: {
-            ...(state.files[action.payload.id] || {}),
-            ...omit(['buffer'], action.payload.file),
-          },
+          [action.payload.id]: {},
         },
         loadErrors: omit([action.payload.id], state.loadErrors),

[Survived] LogicalOperator
src/state/audioFiles/reducer.ts:43:48
         files: {
           ...state.files,
           [action.payload.id]: {
-            ...(state.files[action.payload.id] || {}),
+            ...(state.files[action.payload.id] && {}),
             ...omit(['buffer'], action.payload.file),
           },

[Survived] ConditionalExpression
src/state/audioFiles/reducer.ts:43:17
         files: {
           ...state.files,
           [action.payload.id]: {
-            ...(state.files[action.payload.id] || {}),
+            ...(true),
             ...omit(['buffer'], action.payload.file),
           },

[Survived] ArrayDeclaration
src/state/audioFiles/reducer.ts:44:21
           ...state.files,
           [action.payload.id]: {
             ...(state.files[action.payload.id] || {}),
-            ...omit(['buffer'], action.payload.file),
+            ...omit([], action.payload.file),
           },
         },

[Survived] ArrayDeclaration
src/state/audioFiles/reducer.ts:48:29
           },
         },
         loadErrors: omit([action.payload.id], state.loadErrors),
-        loadingIds: without([action.payload.id], state.loadingIds),
+        loadingIds: without([], state.loadingIds),
       }
     case 'AUDIO_FILE_LOAD_ERROR':

[Survived] ConditionalExpression
src/state/audioFiles/reducer.ts:50:5
         loadErrors: omit([action.payload.id], state.loadErrors),
         loadingIds: without([action.payload.id], state.loadingIds),
       }
-    case 'AUDIO_FILE_LOAD_ERROR':
-      return {
-        ...state,
-        loadErrors: {
-          ...state.loadErrors,
-          [action.payload.id]: action.payload.error,
-        },
-        loadingIds: without([action.payload.id], state.loadingIds),
-      }
+    case 'AUDIO_FILE_LOAD_ERROR':
     case 'AUDIO_FILE_DECODE_START':
       return {

[Survived] StringLiteral
src/state/audioFiles/reducer.ts:50:10
         loadErrors: omit([action.payload.id], state.loadErrors),
         loadingIds: without([action.payload.id], state.loadingIds),
       }
-    case 'AUDIO_FILE_LOAD_ERROR':
+    case "":
       return {
         ...state,

[Survived] ConditionalExpression
src/state/audioFiles/reducer.ts:59:5
         },
         loadingIds: without([action.payload.id], state.loadingIds),
       }
-    case 'AUDIO_FILE_DECODE_START':
-      return {
-        ...state,
-        decodeErrors: omit([action.payload.id], state.decodeErrors),
-        decodingIds: without([action.payload.id], state.decodingIds).concat(
-          action.payload.id,
-        ),
-      }
+    case 'AUDIO_FILE_DECODE_START':
     case 'AUDIO_FILE_DECODE_COMPLETE':
       return {

[Survived] ArrayDeclaration
src/state/audioFiles/reducer.ts:63:30
       return {
         ...state,
         decodeErrors: omit([action.payload.id], state.decodeErrors),
-        decodingIds: without([action.payload.id], state.decodingIds).concat(
+        decodingIds: without([], state.decodingIds).concat(
           action.payload.id,
         ),

[Survived] ConditionalExpression
src/state/audioFiles/reducer.ts:67:5
           action.payload.id,
         ),
       }
-    case 'AUDIO_FILE_DECODE_COMPLETE':
-      return {
-        ...state,
-        decodeErrors: omit([action.payload.id], state.decodeErrors),
-        decodingIds: without([action.payload.id], state.decodingIds),
-        files: {
-          ...state.files,
-          [action.payload.id]: {
-            ...(state.files[action.payload.id] || {}),
-            ...action.payload.file,
-          },
-        },
-      }
+    case 'AUDIO_FILE_DECODE_COMPLETE':
     case 'AUDIO_FILE_DECODE_ERROR':
       return {

[Survived] StringLiteral
src/state/audioFiles/reducer.ts:67:10
           action.payload.id,
         ),
       }
-    case 'AUDIO_FILE_DECODE_COMPLETE':
+    case "":
       return {
         ...state,

[Survived] ObjectLiteral
src/state/audioFiles/reducer.ts:68:14
         ),
       }
     case 'AUDIO_FILE_DECODE_COMPLETE':
-      return {
-        ...state,
-        decodeErrors: omit([action.payload.id], state.decodeErrors),
-        decodingIds: without([action.payload.id], state.decodingIds),
-        files: {
-          ...state.files,
-          [action.payload.id]: {
-            ...(state.files[action.payload.id] || {}),
-            ...action.payload.file,
-          },
-        },
-      }
+      return {}
     case 'AUDIO_FILE_DECODE_ERROR':
       return {

[Survived] ConditionalExpression
src/state/audioFiles/reducer.ts:80:5
           },
         },
       }
-    case 'AUDIO_FILE_DECODE_ERROR':
-      return {
-        ...state,
-        decodeErrors: {
-          ...state.decodeErrors,
-          [action.payload.id]: action.payload.error,
-        },
-        decodingIds: without([action.payload.id], state.decodingIds),
-      }
+    case 'AUDIO_FILE_DECODE_ERROR':
     default:
       return state

[Survived] StringLiteral
src/state/audioFiles/reducer.ts:80:10
           },
         },
       }
-    case 'AUDIO_FILE_DECODE_ERROR':
+    case "":
       return {
         ...state,

[Survived] ObjectLiteral
src/state/audioFiles/reducer.ts:81:14
         },
       }
     case 'AUDIO_FILE_DECODE_ERROR':
-      return {
-        ...state,
-        decodeErrors: {
-          ...state.decodeErrors,
-          [action.payload.id]: action.payload.error,
-        },
-        decodingIds: without([action.payload.id], state.decodingIds),
-      }
+      return {}
     default:
       return state

[Survived] ArrayDeclaration
src/state/audioFiles/reducer.ts:87:30
           ...state.decodeErrors,
           [action.payload.id]: action.payload.error,
         },
-        decodingIds: without([action.payload.id], state.decodingIds),
+        decodingIds: without([], state.decodingIds),
       }
     default:
