[Survived] ArrowFunction
src/state/audioFiles/selectors.ts:6:33
 
 import { ApplicationState } from '~/state/configureStore'
 
-const audioFilesStateSelector = (state: ApplicationState) => state.audioFiles
+const audioFilesStateSelector = () => undefined
 
 export const audioFilesSelector = createSelector(

[Survived] StringLiteral
src/state/audioFiles/selectors.ts:10:8
 
 export const audioFilesSelector = createSelector(
   audioFilesStateSelector,
-  prop('files'),
+  prop(""),
 )
 

[Survived] ArrowFunction
src/state/audioFiles/selectors.ts:20:3
 
 export const audioFilesErrorSelector = createSelector(
   audioFilesStateSelector,
-  state => ({ ...state.loadErrors, ...state.decodeErrors }),
+  () => undefined,
 )
 

[Survived] ObjectLiteral
src/state/audioFiles/selectors.ts:20:13
 
 export const audioFilesErrorSelector = createSelector(
   audioFilesStateSelector,
-  state => ({ ...state.loadErrors, ...state.decodeErrors }),
+  state => ({}),
 )
 
