[Survived] ArrowFunction
src/state/audioNodes/actions.ts:12:35
   AudioNodeUpdateAudioPropsAction,
 } from './types'
 
-export const addAudioNodeAction = (type: string): AudioNodeAddAction => ({
-  payload: { type },
-  type: 'AUDIO_NODE_ADD',
-})
+export const addAudioNodeAction = () => undefined
 
 export const addDelayAction = () => addAudioNodeAction(delayType)

[Survived] ObjectLiteral
src/state/audioNodes/actions.ts:12:74
   AudioNodeUpdateAudioPropsAction,
 } from './types'
 
-export const addAudioNodeAction = (type: string): AudioNodeAddAction => ({
-  payload: { type },
-  type: 'AUDIO_NODE_ADD',
-})
+export const addAudioNodeAction = (type: string): AudioNodeAddAction => ({})
 
 export const addDelayAction = () => addAudioNodeAction(delayType)

[Survived] StringLiteral
src/state/audioNodes/actions.ts:14:9
 
 export const addAudioNodeAction = (type: string): AudioNodeAddAction => ({
   payload: { type },
-  type: 'AUDIO_NODE_ADD',
+  type: "",
 })
 

[Survived] ArrowFunction
src/state/audioNodes/actions.ts:17:31
   type: 'AUDIO_NODE_ADD',
 })
 
-export const addDelayAction = () => addAudioNodeAction(delayType)
+export const addDelayAction = () => undefined
 
 export const addReverbAction = () => addAudioNodeAction(reverbType)

[Survived] ArrowFunction
src/state/audioNodes/actions.ts:19:32
 
 export const addDelayAction = () => addAudioNodeAction(delayType)
 
-export const addReverbAction = () => addAudioNodeAction(reverbType)
+export const addReverbAction = () => undefined
 
 export const addLoopAction = () => addAudioNodeAction(loopType)

[Survived] ArrowFunction
src/state/audioNodes/actions.ts:21:30
 
 export const addReverbAction = () => addAudioNodeAction(reverbType)
 
-export const addLoopAction = () => addAudioNodeAction(loopType)
+export const addLoopAction = () => undefined
 
 export const removeAudioNodeAction = (id: string): AudioNodeRemoveAction => ({

[Survived] ArrowFunction
src/state/audioNodes/actions.ts:23:38
 
 export const addLoopAction = () => addAudioNodeAction(loopType)
 
-export const removeAudioNodeAction = (id: string): AudioNodeRemoveAction => ({
-  payload: { id },
-  type: 'AUDIO_NODE_REMOVE',
-})
+export const removeAudioNodeAction = () => undefined
 
 export const updateAudioNodeAudioPropsAction = (

[Survived] ObjectLiteral
src/state/audioNodes/actions.ts:23:78
 
 export const addLoopAction = () => addAudioNodeAction(loopType)
 
-export const removeAudioNodeAction = (id: string): AudioNodeRemoveAction => ({
-  payload: { id },
-  type: 'AUDIO_NODE_REMOVE',
-})
+export const removeAudioNodeAction = (id: string): AudioNodeRemoveAction => ({})
 
 export const updateAudioNodeAudioPropsAction = (

[Survived] ObjectLiteral
src/state/audioNodes/actions.ts:24:12
 export const addLoopAction = () => addAudioNodeAction(loopType)
 
 export const removeAudioNodeAction = (id: string): AudioNodeRemoveAction => ({
-  payload: { id },
+  payload: {},
   type: 'AUDIO_NODE_REMOVE',
 })

[Survived] ArrowFunction
src/state/audioNodes/actions.ts:28:48
   type: 'AUDIO_NODE_REMOVE',
 })
 
-export const updateAudioNodeAudioPropsAction = (
-  id: string,
-  audioProps: object,
-): AudioNodeUpdateAudioPropsAction => ({
-  payload: { id, audioProps },
-  type: 'AUDIO_NODE_UPDATE_AUDIO_PROPS',
-})
+export const updateAudioNodeAudioPropsAction = () => undefined
 
 export const updateAudioNodeLabelAction = (

[Survived] ArrowFunction
src/state/audioNodes/actions.ts:36:43
   type: 'AUDIO_NODE_UPDATE_AUDIO_PROPS',
 })
 
-export const updateAudioNodeLabelAction = (
-  id: string,
-  label: string,
-): AudioNodeUpdateLabelAction => ({
-  payload: { id, label },
-  type: 'AUDIO_NODE_UPDATE_LABEL',
-})
+export const updateAudioNodeLabelAction = () => undefined
 

[Survived] ObjectLiteral
src/state/audioNodes/actions.ts:39:35
 export const updateAudioNodeLabelAction = (
   id: string,
   label: string,
-): AudioNodeUpdateLabelAction => ({
-  payload: { id, label },
-  type: 'AUDIO_NODE_UPDATE_LABEL',
-})
+): AudioNodeUpdateLabelAction => ({})
 

[Survived] ObjectLiteral
src/state/audioNodes/actions.ts:40:12
   id: string,
   label: string,
 ): AudioNodeUpdateLabelAction => ({
-  payload: { id, label },
+  payload: {},
   type: 'AUDIO_NODE_UPDATE_LABEL',
 })

[Survived] StringLiteral
src/state/audioNodes/actions.ts:41:9
   label: string,
 ): AudioNodeUpdateLabelAction => ({
   payload: { id, label },
-  type: 'AUDIO_NODE_UPDATE_LABEL',
+  type: "",
 })
 
