[Survived] BlockStatement
src/state/audioNodes/reducer.ts:37:41
 }
 
 const defaultState: AudioNodesState = initialNodes.reduce(
-  (acc: AudioNodesState, instrument) => {
-    acc.byId[instrument.id] = instrument
-    acc.orderedMeta.push({ id: instrument.id, type: instrument.type })
-    return acc
-  },
+  (acc: AudioNodesState, instrument) => {},
   { byId: {}, orderedMeta: [] },
 )

[Survived] ArrayDeclaration
src/state/audioNodes/reducer.ts:42:28
     acc.orderedMeta.push({ id: instrument.id, type: instrument.type })
     return acc
   },
-  { byId: {}, orderedMeta: [] },
+  { byId: {}, orderedMeta: ["Stryker was here"] },
 )
 

[Survived] ConditionalExpression
src/state/audioNodes/reducer.ts:47:5
 
 const getNewNodeState = (type: string): AudioNodeState | null => {
   switch (type) {
-    case delayNodeType:
-      return {
-        type,
-        id: prefixedId(delayNodeType),
-        label: 'DX',
-        audioProps: { ...delayDefaultProps },
-      }
+    case delayNodeType:
     case reverbNodeType: {
       return {

[Survived] BlockStatement
src/state/audioNodes/reducer.ts:54:26
         label: 'DX',
         audioProps: { ...delayDefaultProps },
       }
-    case reverbNodeType: {
-      return {
-        type,
-        id: prefixedId(reverbNodeType),
-        label: `RX`,
-        audioProps: { ...reverbDefaultProps },
-      }
-    }
+    case reverbNodeType: {}
     case loopNodeType: {
       return {

[Survived] ConditionalExpression
src/state/audioNodes/reducer.ts:54:5
         label: 'DX',
         audioProps: { ...delayDefaultProps },
       }
-    case reverbNodeType: {
-      return {
-        type,
-        id: prefixedId(reverbNodeType),
-        label: `RX`,
-        audioProps: { ...reverbDefaultProps },
-      }
-    }
+    case reverbNodeType:
     case loopNodeType: {
       return {

[Survived] ObjectLiteral
src/state/audioNodes/reducer.ts:55:14
         audioProps: { ...delayDefaultProps },
       }
     case reverbNodeType: {
-      return {
-        type,
-        id: prefixedId(reverbNodeType),
-        label: `RX`,
-        audioProps: { ...reverbDefaultProps },
-      }
+      return {}
     }
     case loopNodeType: {

[Survived] StringLiteral
src/state/audioNodes/reducer.ts:58:16
       return {
         type,
         id: prefixedId(reverbNodeType),
-        label: `RX`,
+        label: "",
         audioProps: { ...reverbDefaultProps },
       }

[Survived] BlockStatement
src/state/audioNodes/reducer.ts:62:24
         audioProps: { ...reverbDefaultProps },
       }
     }
-    case loopNodeType: {
-      return {
-        type,
-        id: prefixedId(loopNodeType),
-        label: 'LX',
-        audioProps: { ...loopDefaultProps },
-      }
-    }
+    case loopNodeType: {}
     default:
       return null

[Survived] ConditionalExpression
src/state/audioNodes/reducer.ts:62:5
         audioProps: { ...reverbDefaultProps },
       }
     }
-    case loopNodeType: {
-      return {
-        type,
-        id: prefixedId(loopNodeType),
-        label: 'LX',
-        audioProps: { ...loopDefaultProps },
-      }
-    }
+    case loopNodeType:
     default:
       return null

[Survived] StringLiteral
src/state/audioNodes/reducer.ts:66:16
       return {
         type,
         id: prefixedId(loopNodeType),
-        label: 'LX',
+        label: "",
         audioProps: { ...loopDefaultProps },
       }

[Survived] ObjectLiteral
src/state/audioNodes/reducer.ts:67:21
         type,
         id: prefixedId(loopNodeType),
         label: 'LX',
-        audioProps: { ...loopDefaultProps },
+        audioProps: {},
       }
     }

[Survived] ConditionalExpression
src/state/audioNodes/reducer.ts:70:5
         audioProps: { ...loopDefaultProps },
       }
     }
-    default:
-      return null
+    default:
   }
 }

[Survived] BlockStatement
src/state/audioNodes/reducer.ts:75:73
   }
 }
 
-const addNode = (state: AudioNodesState, { type }: { type: string }) => {
-  const newNodeState = getNewNodeState(type)
-
-  if (!newNodeState) return state
-
-  return produce<AudioNodesState>(state, draftState => {
-    draftState.byId[newNodeState.id] = newNodeState
-    draftState.orderedMeta.push({
-      id: newNodeState.id,
-      type: newNodeState.type,
-    })
-  })
-}
+const addNode = (state: AudioNodesState, { type }: { type: string }) => {}
 
 const audioNodesReducer: Reducer<

[Survived] ConditionalExpression
src/state/audioNodes/reducer.ts:78:7
 const addNode = (state: AudioNodesState, { type }: { type: string }) => {
   const newNodeState = getNewNodeState(type)
 
-  if (!newNodeState) return state
+  if (false) return state
 
   return produce<AudioNodesState>(state, draftState => {

[Survived] ConditionalExpression
src/state/audioNodes/reducer.ts:78:7
 const addNode = (state: AudioNodesState, { type }: { type: string }) => {
   const newNodeState = getNewNodeState(type)
 
-  if (!newNodeState) return state
+  if (true) return state
 
   return produce<AudioNodesState>(state, draftState => {

[Survived] BlockStatement
src/state/audioNodes/reducer.ts:80:56
 
   if (!newNodeState) return state
 
-  return produce<AudioNodesState>(state, draftState => {
-    draftState.byId[newNodeState.id] = newNodeState
-    draftState.orderedMeta.push({
-      id: newNodeState.id,
-      type: newNodeState.type,
-    })
-  })
+  return produce<AudioNodesState>(state, draftState => {})
 }
 

[Survived] ConditionalExpression
src/state/audioNodes/reducer.ts:94:5
   AudioNodesAction | AudioFileDecodeCompleteAction
 > = (state = defaultState, action) => {
   switch (action.type) {
-    case 'AUDIO_NODE_ADD':
-      return addNode(state, action.payload)
+    case 'AUDIO_NODE_ADD':
     case 'AUDIO_NODE_REMOVE':
       return produce(state, draftState => {

[Survived] StringLiteral
src/state/audioNodes/reducer.ts:94:10
   AudioNodesAction | AudioFileDecodeCompleteAction
 > = (state = defaultState, action) => {
   switch (action.type) {
-    case 'AUDIO_NODE_ADD':
+    case "":
       return addNode(state, action.payload)
     case 'AUDIO_NODE_REMOVE':

[Survived] ConditionalExpression
src/state/audioNodes/reducer.ts:96:5
   switch (action.type) {
     case 'AUDIO_NODE_ADD':
       return addNode(state, action.payload)
-    case 'AUDIO_NODE_REMOVE':
-      return produce(state, draftState => {
-        const { id } = action.payload
-
-        if (draftState.byId[id]) delete draftState.byId[id]
-
-        const orderedMetaIndex = draftState.orderedMeta.findIndex(
-          meta => meta.id === id,
-        )
-
-        if (orderedMetaIndex > -1) {
-          draftState.orderedMeta.splice(orderedMetaIndex, 1)
-        }
-      })
+    case 'AUDIO_NODE_REMOVE':
     case 'AUDIO_NODE_UPDATE_AUDIO_PROPS':
       return produce(state, draftState => {

[Survived] BlockStatement
src/state/audioNodes/reducer.ts:97:43
     case 'AUDIO_NODE_ADD':
       return addNode(state, action.payload)
     case 'AUDIO_NODE_REMOVE':
-      return produce(state, draftState => {
-        const { id } = action.payload
-
-        if (draftState.byId[id]) delete draftState.byId[id]
-
-        const orderedMetaIndex = draftState.orderedMeta.findIndex(
-          meta => meta.id === id,
-        )
-
-        if (orderedMetaIndex > -1) {
-          draftState.orderedMeta.splice(orderedMetaIndex, 1)
-        }
-      })
+      return produce(state, draftState => {})
     case 'AUDIO_NODE_UPDATE_AUDIO_PROPS':
       return produce(state, draftState => {

[Survived] ConditionalExpression
src/state/audioNodes/reducer.ts:100:13
       return produce(state, draftState => {
         const { id } = action.payload
 
-        if (draftState.byId[id]) delete draftState.byId[id]
+        if (true) delete draftState.byId[id]
 
         const orderedMetaIndex = draftState.orderedMeta.findIndex(

[Survived] ConditionalExpression
src/state/audioNodes/reducer.ts:100:13
       return produce(state, draftState => {
         const { id } = action.payload
 
-        if (draftState.byId[id]) delete draftState.byId[id]
+        if (false) delete draftState.byId[id]
 
         const orderedMetaIndex = draftState.orderedMeta.findIndex(

[Survived] ArrowFunction
src/state/audioNodes/reducer.ts:103:11
         if (draftState.byId[id]) delete draftState.byId[id]
 
         const orderedMetaIndex = draftState.orderedMeta.findIndex(
-          meta => meta.id === id,
+          () => undefined,
         )
 

[Survived] ConditionalExpression
src/state/audioNodes/reducer.ts:103:19
         if (draftState.byId[id]) delete draftState.byId[id]
 
         const orderedMetaIndex = draftState.orderedMeta.findIndex(
-          meta => meta.id === id,
+          meta => true,
         )
 

[Survived] ConditionalExpression
src/state/audioNodes/reducer.ts:106:13
           meta => meta.id === id,
         )
 
-        if (orderedMetaIndex > -1) {
+        if (false) {
           draftState.orderedMeta.splice(orderedMetaIndex, 1)
         }

[Survived] ConditionalExpression
src/state/audioNodes/reducer.ts:106:13
           meta => meta.id === id,
         )
 
-        if (orderedMetaIndex > -1) {
+        if (true) {
           draftState.orderedMeta.splice(orderedMetaIndex, 1)
         }

[Survived] ConditionalExpression
src/state/audioNodes/reducer.ts:110:5
           draftState.orderedMeta.splice(orderedMetaIndex, 1)
         }
       })
-    case 'AUDIO_NODE_UPDATE_AUDIO_PROPS':
-      return produce(state, draftState => {
-        const existing = draftState.byId[action.payload.id]
-
-        if (existing) {
-          Object.assign(existing.audioProps, action.payload.audioProps)
-        }
-      })
+    case 'AUDIO_NODE_UPDATE_AUDIO_PROPS':
     case 'AUDIO_NODE_UPDATE_LABEL':
       return produce(state, draftState => {

[Survived] BlockStatement
src/state/audioNodes/reducer.ts:111:43
         }
       })
     case 'AUDIO_NODE_UPDATE_AUDIO_PROPS':
-      return produce(state, draftState => {
-        const existing = draftState.byId[action.payload.id]
-
-        if (existing) {
-          Object.assign(existing.audioProps, action.payload.audioProps)
-        }
-      })
+      return produce(state, draftState => {})
     case 'AUDIO_NODE_UPDATE_LABEL':
       return produce(state, draftState => {

[Survived] ConditionalExpression
src/state/audioNodes/reducer.ts:114:13
       return produce(state, draftState => {
         const existing = draftState.byId[action.payload.id]
 
-        if (existing) {
+        if (true) {
           Object.assign(existing.audioProps, action.payload.audioProps)
         }

[Survived] ConditionalExpression
src/state/audioNodes/reducer.ts:114:13
       return produce(state, draftState => {
         const existing = draftState.byId[action.payload.id]
 
-        if (existing) {
+        if (false) {
           Object.assign(existing.audioProps, action.payload.audioProps)
         }

[Survived] ConditionalExpression
src/state/audioNodes/reducer.ts:118:5
           Object.assign(existing.audioProps, action.payload.audioProps)
         }
       })
-    case 'AUDIO_NODE_UPDATE_LABEL':
-      return produce(state, draftState => {
-        const existing = draftState.byId[action.payload.id]
-
-        if (existing) existing.label = action.payload.label
-      })
+    case 'AUDIO_NODE_UPDATE_LABEL':
     case 'AUDIO_FILE_DECODE_COMPLETE':
       return produce(state, draftState => {

[Survived] StringLiteral
src/state/audioNodes/reducer.ts:118:10
           Object.assign(existing.audioProps, action.payload.audioProps)
         }
       })
-    case 'AUDIO_NODE_UPDATE_LABEL':
+    case "":
       return produce(state, draftState => {
         const existing = draftState.byId[action.payload.id]

[Survived] BlockStatement
src/state/audioNodes/reducer.ts:119:43
         }
       })
     case 'AUDIO_NODE_UPDATE_LABEL':
-      return produce(state, draftState => {
-        const existing = draftState.byId[action.payload.id]
-
-        if (existing) existing.label = action.payload.label
-      })
+      return produce(state, draftState => {})
     case 'AUDIO_FILE_DECODE_COMPLETE':
       return produce(state, draftState => {

[Survived] ConditionalExpression
src/state/audioNodes/reducer.ts:122:13
       return produce(state, draftState => {
         const existing = draftState.byId[action.payload.id]
 
-        if (existing) existing.label = action.payload.label
+        if (true) existing.label = action.payload.label
       })
     case 'AUDIO_FILE_DECODE_COMPLETE':

[Survived] ConditionalExpression
src/state/audioNodes/reducer.ts:122:13
       return produce(state, draftState => {
         const existing = draftState.byId[action.payload.id]
 
-        if (existing) existing.label = action.payload.label
+        if (false) existing.label = action.payload.label
       })
     case 'AUDIO_FILE_DECODE_COMPLETE':

[Survived] ConditionalExpression
src/state/audioNodes/reducer.ts:124:5
 
         if (existing) existing.label = action.payload.label
       })
-    case 'AUDIO_FILE_DECODE_COMPLETE':
-      return produce(state, draftState => {
-        const { id, file } = action.payload
-        const existing = draftState.byId[id]
-
-        if (existing) {
-          Object.assign(
-            existing.audioProps,
-            pickObjectKeys(existing.audioProps)(file),
-          )
-        }
-      })
+    case 'AUDIO_FILE_DECODE_COMPLETE':
     default:
       return state

[Survived] StringLiteral
src/state/audioNodes/reducer.ts:124:10
 
         if (existing) existing.label = action.payload.label
       })
-    case 'AUDIO_FILE_DECODE_COMPLETE':
+    case "":
       return produce(state, draftState => {
         const { id, file } = action.payload

[Survived] BlockStatement
src/state/audioNodes/reducer.ts:125:43
         if (existing) existing.label = action.payload.label
       })
     case 'AUDIO_FILE_DECODE_COMPLETE':
-      return produce(state, draftState => {
-        const { id, file } = action.payload
-        const existing = draftState.byId[id]
-
-        if (existing) {
-          Object.assign(
-            existing.audioProps,
-            pickObjectKeys(existing.audioProps)(file),
-          )
-        }
-      })
+      return produce(state, draftState => {})
     default:
       return state

[Survived] BlockStatement
src/state/audioNodes/reducer.ts:129:23
         const { id, file } = action.payload
         const existing = draftState.byId[id]
 
-        if (existing) {
-          Object.assign(
-            existing.audioProps,
-            pickObjectKeys(existing.audioProps)(file),
-          )
-        }
+        if (existing) {}
       })
     default:
