[Survived] ArrowFunction
src/state/audioNodes/selectors.ts:9:33
 import { ApplicationState } from '~/state/configureStore'
 import { connectionsSelector } from '~/state/connections/selectors'
 
-const audioNodesStateSelector = (state: ApplicationState) => state.audioNodes
+const audioNodesStateSelector = () => undefined
 
 export const audioNodesSelector = createSelector(

[Survived] ArrowFunction
src/state/audioNodes/selectors.ts:13:3
 
 export const audioNodesSelector = createSelector(
   audioNodesStateSelector,
-  state => state.byId,
+  () => undefined,
 )
 

[Survived] ArrowFunction
src/state/audioNodes/selectors.ts:20:3
 
 export const immutableNodesMetaSelector = createSelector(
   audioNodesStateSelector,
-  state => state.orderedMeta,
+  () => undefined,
 )
 

[Survived] ArrowFunction
src/state/audioNodes/selectors.ts:25:3
 
 export const immutableInstrumentsMetaSelector = createSelector(
   immutableNodesMetaSelector,
-  meta => meta.filter(isInstrument),
+  () => undefined,
 )
 

[Survived] ArrowFunction
src/state/audioNodes/selectors.ts:30:3
 
 export const immutableAudioEffectsMetaSelector = createSelector(
   immutableNodesMetaSelector,
-  meta => meta.filter(isAudioEffect),
+  () => undefined,
 )
 

[Survived] ArrowFunction
src/state/audioNodes/selectors.ts:35:3
 
 export const mainOutNodeSelector = createSelector(
   audioNodesSelector,
-  nodes => nodes[MAIN_OUT_ID],
+  () => undefined,
 )
 

[Survived] ArrowFunction
src/state/audioNodes/selectors.ts:40:3
 
 export const mainOutMetaSelector = createSelector(
   mainOutNodeSelector,
-  ({ id, type, label }): AudioNodeMeta => ({ id, type, label }),
+  () => undefined,
 )
 

[Survived] BlockStatement
src/state/audioNodes/selectors.ts:47:35
   immutableNodesMetaSelector,
   connectionsSelector,
   mainOutNodeSelector,
-  (meta, connections, mainOut) => {
-    const connectedToMain = hasConnectionTo(connections, mainOut.id)
-
-    return meta.map(({ id }) => id).filter(connectedToMain)
-  },
+  (meta, connections, mainOut) => {},
 )
 

[Survived] ArrowFunction
src/state/audioNodes/selectors.ts:50:21
   (meta, connections, mainOut) => {
     const connectedToMain = hasConnectionTo(connections, mainOut.id)
 
-    return meta.map(({ id }) => id).filter(connectedToMain)
+    return meta.map(() => undefined).filter(connectedToMain)
   },
 )

[Survived] ArrowFunction
src/state/audioNodes/selectors.ts:58:3
   audioNodesSelector,
   immutableInstrumentsMetaSelector,
   immutableAudioEffectsMetaSelector,
-  (nodes, instruments, effects) => [
-    ...instruments.map(meta => ({ ...meta, label: nodes[meta.id].label })),
-    ...effects.map(meta => ({ ...meta, label: nodes[meta.id].label })),
-  ],
+  () => undefined,
 )
 

[Survived] ArrowFunction
src/state/audioNodes/selectors.ts:59:24
   immutableInstrumentsMetaSelector,
   immutableAudioEffectsMetaSelector,
   (nodes, instruments, effects) => [
-    ...instruments.map(meta => ({ ...meta, label: nodes[meta.id].label })),
+    ...instruments.map(() => undefined),
     ...effects.map(meta => ({ ...meta, label: nodes[meta.id].label })),
   ],

[Survived] ArrowFunction
src/state/audioNodes/selectors.ts:60:20
   immutableAudioEffectsMetaSelector,
   (nodes, instruments, effects) => [
     ...instruments.map(meta => ({ ...meta, label: nodes[meta.id].label })),
-    ...effects.map(meta => ({ ...meta, label: nodes[meta.id].label })),
+    ...effects.map(() => undefined),
   ],
 )

[Survived] ArrowFunction
src/state/audioNodes/selectors.ts:68:3
   audioNodesSelector,
   immutableAudioEffectsMetaSelector,
   mainOutMetaSelector,
-  (nodes, effects, out) => [
-    ...effects.map(meta => ({ ...meta, label: nodes[meta.id].label })),
-    out,
-  ],
+  () => undefined,
 )
 

[Survived] ArrayDeclaration
src/state/audioNodes/selectors.ts:68:28
   audioNodesSelector,
   immutableAudioEffectsMetaSelector,
   mainOutMetaSelector,
-  (nodes, effects, out) => [
-    ...effects.map(meta => ({ ...meta, label: nodes[meta.id].label })),
-    out,
-  ],
+  (nodes, effects, out) => [],
 )
 

[Survived] ArrowFunction
src/state/audioNodes/selectors.ts:69:20
   immutableAudioEffectsMetaSelector,
   mainOutMetaSelector,
   (nodes, effects, out) => [
-    ...effects.map(meta => ({ ...meta, label: nodes[meta.id].label })),
+    ...effects.map(() => undefined),
     out,
   ],
