[Survived] ArrowFunction
gleetchy/src/state/configureStore.ts:40:31
 
 export type ApplicationStore = Store<ApplicationState, ApplicationAction>
 
-export const configureStore = (
-  initialState: Partial<ApplicationState> = {},
-): ApplicationStore =>
-  createStore(
-    combineReducers({
-      audioEngine,
-      audioFiles,
-      audioNodes,
-      connections,
-      globalPlayback,
-      ui,
-    }),
-    initialState,
-    composeEnhancers(applyMiddleware(...middlewares)),
-  )
+export const configureStore = () => undefined
 
