[Survived] ArrowFunction
src/state/connections/actions.ts:9:36
 import { connectionsSelector } from './selectors'
 import { ConnectionAddAction, ConnectionRemoveAction } from './types'
 
-export const addConnectionAction = (
-  fromId: string,
-  toId: string,
-): ConnectionAddAction => ({
-  payload: { fromId, toId },
-  type: 'CONNECTION_ADD',
-})
+export const addConnectionAction = () => undefined
 
 export const removeConnectionAction = (

[Survived] StringLiteral
src/state/connections/actions.ts:14:9
   toId: string,
 ): ConnectionAddAction => ({
   payload: { fromId, toId },
-  type: 'CONNECTION_ADD',
+  type: "",
 })
 

[Survived] ArrowFunction
src/state/connections/actions.ts:17:39
   type: 'CONNECTION_ADD',
 })
 
-export const removeConnectionAction = (
-  fromId: string,
-  toId: string,
-): ConnectionRemoveAction => ({
-  payload: { fromId, toId },
-  type: 'CONNECTION_REMOVE',
-})
+export const removeConnectionAction = () => undefined
 
 export const toggleConnectionAction = (fromId: string, toId: string) => (

[Survived] ArrowFunction
src/state/connections/actions.ts:25:39
   type: 'CONNECTION_REMOVE',
 })
 
-export const toggleConnectionAction = (fromId: string, toId: string) => (
-  dispatch: Dispatch,
-  getState: () => ApplicationState,
-) => {
-  const connections = connectionsSelector(getState())
-  const existing = connections.find(
-    isSameConnection({ from: fromId, to: toId }),
-  )
-
-  if (existing) {
-    dispatch<ConnectionRemoveAction>(removeConnectionAction(fromId, toId))
-  } else {
-    dispatch<ConnectionAddAction>(addConnectionAction(fromId, toId))
-  }
-}
+export const toggleConnectionAction = () => undefined
 

[Survived] BlockStatement
src/state/connections/actions.ts:28:6
 export const toggleConnectionAction = (fromId: string, toId: string) => (
   dispatch: Dispatch,
   getState: () => ApplicationState,
-) => {
-  const connections = connectionsSelector(getState())
-  const existing = connections.find(
-    isSameConnection({ from: fromId, to: toId }),
-  )
-
-  if (existing) {
-    dispatch<ConnectionRemoveAction>(removeConnectionAction(fromId, toId))
-  } else {
-    dispatch<ConnectionAddAction>(addConnectionAction(fromId, toId))
-  }
-}
+) => {}
 

[Survived] ObjectLiteral
src/state/connections/actions.ts:31:22
 ) => {
   const connections = connectionsSelector(getState())
   const existing = connections.find(
-    isSameConnection({ from: fromId, to: toId }),
+    isSameConnection({}),
   )
 

[Survived] BlockStatement
src/state/connections/actions.ts:34:17
     isSameConnection({ from: fromId, to: toId }),
   )
 
-  if (existing) {
-    dispatch<ConnectionRemoveAction>(removeConnectionAction(fromId, toId))
-  } else {
+  if (existing) {} else {
     dispatch<ConnectionAddAction>(addConnectionAction(fromId, toId))
   }

[Survived] BlockStatement
src/state/connections/actions.ts:36:10
 
   if (existing) {
     dispatch<ConnectionRemoveAction>(removeConnectionAction(fromId, toId))
-  } else {
-    dispatch<ConnectionAddAction>(addConnectionAction(fromId, toId))
-  }
+  } else {}
 }
 
