[Survived] ArrowFunction
src/state/connections/reducer.ts:22:22
   { from: loop2.id, to: mainOut.id, color: nodeColorPool[1] },
 ]
 
-const connectionIs = ({ fromId, toId }: ConnectionDescriptor) =>
-  allPass([propEq('from', fromId), propEq('to', toId)])
+const connectionIs = () => undefined
 
 const addConnection = (

[Survived] StringLiteral
src/state/connections/reducer.ts:23:19
 ]
 
 const connectionIs = ({ fromId, toId }: ConnectionDescriptor) =>
-  allPass([propEq('from', fromId), propEq('to', toId)])
+  allPass([propEq("", fromId), propEq('to', toId)])
 
 const addConnection = (

[Survived] StringLiteral
src/state/connections/reducer.ts:23:43
 ]
 
 const connectionIs = ({ fromId, toId }: ConnectionDescriptor) =>
-  allPass([propEq('from', fromId), propEq('to', toId)])
+  allPass([propEq('from', fromId), propEq("", toId)])
 
 const addConnection = (

[Survived] BlockStatement
src/state/connections/reducer.ts:28:6
 const addConnection = (
   state: ConnectionsState,
   { fromId, toId }: ConnectionDescriptor,
-) => {
-  const existing = state.find(connectionIs({ fromId, toId }))
-
-  return existing
-    ? state
-    : [
-        ...state,
-        {
-          from: fromId,
-          to: toId,
-          color: nodeColorPool[state.length % nodeColorPool.length],
-        },
-      ]
-}
+) => {}
 
 const removeConnection = (

[Survived] ArrayDeclaration
src/state/connections/reducer.ts:33:7
 
   return existing
     ? state
-    : [
-        ...state,
-        {
-          from: fromId,
-          to: toId,
-          color: nodeColorPool[state.length % nodeColorPool.length],
-        },
-      ]
+    : []
 }
 

[Survived] ObjectLiteral
src/state/connections/reducer.ts:35:9
     ? state
     : [
         ...state,
-        {
-          from: fromId,
-          to: toId,
-          color: nodeColorPool[state.length % nodeColorPool.length],
-        },
+        {},
       ]
 }

[Survived] ArithmeticOperator
src/state/connections/reducer.ts:38:45
         {
           from: fromId,
           to: toId,
-          color: nodeColorPool[state.length % nodeColorPool.length],
+          color: nodeColorPool[state.length * nodeColorPool.length],
         },
       ]

[Survived] BlockStatement
src/state/connections/reducer.ts:46:6
 const removeConnection = (
   state: ConnectionsState,
   { fromId, toId }: ConnectionDescriptor,
-) => {
-  const existing = state.find(connectionIs({ fromId, toId }))
-
-  return existing ? without([existing], state) : state
-}
+) => {}
 
 const removeAllConnectionsForId = (

[Survived] ObjectLiteral
src/state/connections/reducer.ts:47:44
   state: ConnectionsState,
   { fromId, toId }: ConnectionDescriptor,
 ) => {
-  const existing = state.find(connectionIs({ fromId, toId }))
+  const existing = state.find(connectionIs({}))
 
   return existing ? without([existing], state) : state

[Survived] BlockStatement
src/state/connections/reducer.ts:55:6
 const removeAllConnectionsForId = (
   state: ConnectionsState,
   { id }: { id: string },
-) => {
-  const toRemove = state.filter(({ from, to }) => from === id || to === id)
-
-  return toRemove.length ? without(toRemove, state) : state
-}
+) => {}
 
 const connectionsReducer: Reducer<

[Survived] ArrowFunction
src/state/connections/reducer.ts:56:33
   state: ConnectionsState,
   { id }: { id: string },
 ) => {
-  const toRemove = state.filter(({ from, to }) => from === id || to === id)
+  const toRemove = state.filter(() => undefined)
 
   return toRemove.length ? without(toRemove, state) : state

[Survived] EqualityOperator
src/state/connections/reducer.ts:56:69
   state: ConnectionsState,
   { id }: { id: string },
 ) => {
-  const toRemove = state.filter(({ from, to }) => from === id || to === id)
+  const toRemove = state.filter(({ from, to }) => from === id || to !== id)
 
   return toRemove.length ? without(toRemove, state) : state

[Survived] BlockStatement
src/state/connections/reducer.ts:64:39
 const connectionsReducer: Reducer<
   ConnectionsState,
   ConnectionsAction | AudioNodeRemoveAction
-> = (state = defaultState, action) => {
-  switch (action.type) {
-    case 'CONNECTION_ADD':
-      return addConnection(state, action.payload)
-    case 'CONNECTION_REMOVE':
-      return removeConnection(state, action.payload)
-    case 'AUDIO_NODE_REMOVE':
-      return removeAllConnectionsForId(state, action.payload)
-    default:
-      return state
-  }
-}
+> = (state = defaultState, action) => {}
 
 export default connectionsReducer

[Survived] ConditionalExpression
src/state/connections/reducer.ts:66:5
   ConnectionsAction | AudioNodeRemoveAction
 > = (state = defaultState, action) => {
   switch (action.type) {
-    case 'CONNECTION_ADD':
-      return addConnection(state, action.payload)
+    case 'CONNECTION_ADD':
     case 'CONNECTION_REMOVE':
       return removeConnection(state, action.payload)

[Survived] ConditionalExpression
src/state/connections/reducer.ts:68:5
   switch (action.type) {
     case 'CONNECTION_ADD':
       return addConnection(state, action.payload)
-    case 'CONNECTION_REMOVE':
-      return removeConnection(state, action.payload)
+    case 'CONNECTION_REMOVE':
     case 'AUDIO_NODE_REMOVE':
       return removeAllConnectionsForId(state, action.payload)

[Survived] ConditionalExpression
src/state/connections/reducer.ts:70:5
       return addConnection(state, action.payload)
     case 'CONNECTION_REMOVE':
       return removeConnection(state, action.payload)
-    case 'AUDIO_NODE_REMOVE':
-      return removeAllConnectionsForId(state, action.payload)
+    case 'AUDIO_NODE_REMOVE':
     default:
       return state

[Survived] ConditionalExpression
src/state/connections/reducer.ts:72:5
       return removeConnection(state, action.payload)
     case 'AUDIO_NODE_REMOVE':
       return removeAllConnectionsForId(state, action.payload)
-    default:
-      return state
+    default:
   }
 }
