[Survived] ArrowFunction
src/state/connections/selectors.ts:6:34
 
 import { ApplicationState } from '~/state/configureStore'
 
-const connectionsStateSelector = (state: ApplicationState) => state.connections
+const connectionsStateSelector = () => undefined
 
 export const connectionsSelector = createSelector(
