[Survived] ObjectLiteral
gleetchy/src/state/defaultNodes.ts:10:3
 const defaultNodes: AudioNodeState<
   delay.NodeProps | reverb.NodeProps | loop.NodeProps | {}
 >[] = [
-  {
-    id: MAIN_OUT_ID,
-    label: 'Main',
-    audioProps: {},
-    type: 'AUDIO_CONTEXT',
-  },
+  {},
   {
     id: 'looper-default0',

[Survived] StringLiteral
gleetchy/src/state/defaultNodes.ts:12:12
 >[] = [
   {
     id: MAIN_OUT_ID,
-    label: 'Main',
+    label: "",
     audioProps: {},
     type: 'AUDIO_CONTEXT',

[Survived] StringLiteral
gleetchy/src/state/defaultNodes.ts:14:11
     id: MAIN_OUT_ID,
     label: 'Main',
     audioProps: {},
-    type: 'AUDIO_CONTEXT',
+    type: "",
   },
   {

[Survived] ObjectLiteral
gleetchy/src/state/defaultNodes.ts:16:3
     audioProps: {},
     type: 'AUDIO_CONTEXT',
   },
-  {
-    id: 'looper-default0',
-    label: 'L0',
-    audioProps: { ...loop.defaultProps },
-    type: loop.nodeType,
-  },
+  {},
   {
     id: 'looper-default1',

[Survived] StringLiteral
gleetchy/src/state/defaultNodes.ts:17:9
     type: 'AUDIO_CONTEXT',
   },
   {
-    id: 'looper-default0',
+    id: "",
     label: 'L0',
     audioProps: { ...loop.defaultProps },

[Survived] StringLiteral
gleetchy/src/state/defaultNodes.ts:23:9
     type: loop.nodeType,
   },
   {
-    id: 'looper-default1',
+    id: "",
     label: 'L1',
     audioProps: { ...loop.defaultProps },

[Survived] StringLiteral
gleetchy/src/state/defaultNodes.ts:24:12
   },
   {
     id: 'looper-default1',
-    label: 'L1',
+    label: "",
     audioProps: { ...loop.defaultProps },
     type: loop.nodeType,

[Survived] StringLiteral
gleetchy/src/state/defaultNodes.ts:29:9
     type: loop.nodeType,
   },
   {
-    id: 'delay-default0',
+    id: "",
     label: 'D0',
     audioProps: { ...delay.defaultProps },

[Survived] StringLiteral
gleetchy/src/state/defaultNodes.ts:35:9
     type: delay.nodeType,
   },
   {
-    id: '​​​​delay-default1',
+    id: "",
     label: 'D1',
     audioProps: { ...delay.defaultProps },

[Survived] StringLiteral
gleetchy/src/state/defaultNodes.ts:42:12
   },
   {
     id: '​​​​​reverb-default0',
-    label: 'R0',
+    label: "",
     audioProps: { ...reverb.defaultProps },
     type: reverb.nodeType,
