[Survived] ArrowFunction
src/state/globalPlayback/actions.ts:9:84
 import { isPlayingSelector } from './selectors'
 import { GlobalPlaybackStartAction, GlobalPlaybackStopAction } from './types'
 
-export const startGlobalPlaybackAction: ActionCreator<GlobalPlaybackStartAction> = () => ({
-  type: 'GLOBAL_PLAYBACK_START',
-})
+export const startGlobalPlaybackAction: ActionCreator<GlobalPlaybackStartAction> = () => undefined
 
 export const stopGlobalPlaybackAction: ActionCreator<GlobalPlaybackStopAction> = () => ({

[Survived] ArrowFunction
src/state/globalPlayback/actions.ts:13:82
   type: 'GLOBAL_PLAYBACK_START',
 })
 
-export const stopGlobalPlaybackAction: ActionCreator<GlobalPlaybackStopAction> = () => ({
-  type: 'GLOBAL_PLAYBACK_STOP',
-})
+export const stopGlobalPlaybackAction: ActionCreator<GlobalPlaybackStopAction> = () => undefined
 
 export const toggleGlobalPlaybackAction = (): ThunkAction<

[Survived] StringLiteral
src/state/globalPlayback/actions.ts:14:9
 })
 
 export const stopGlobalPlaybackAction: ActionCreator<GlobalPlaybackStopAction> = () => ({
-  type: 'GLOBAL_PLAYBACK_STOP',
+  type: "",
 })
 

[Survived] ArrowFunction
src/state/globalPlayback/actions.ts:17:43
   type: 'GLOBAL_PLAYBACK_STOP',
 })
 
-export const toggleGlobalPlaybackAction = (): ThunkAction<
-  void,
-  ApplicationState,
-  undefined,
-  GlobalPlaybackStartAction | GlobalPlaybackStopAction
-> => (dispatch, getState) => {
-  const isPlaying = isPlayingSelector(getState())
-
-  if (isPlaying) {
-    dispatch<GlobalPlaybackStopAction>(stopGlobalPlaybackAction())
-  } else {
-    dispatch<GlobalPlaybackStartAction>(startGlobalPlaybackAction())
-  }
-}
+export const toggleGlobalPlaybackAction = () => undefined
 

[Survived] BlockStatement
src/state/globalPlayback/actions.ts:22:30
   ApplicationState,
   undefined,
   GlobalPlaybackStartAction | GlobalPlaybackStopAction
-> => (dispatch, getState) => {
-  const isPlaying = isPlayingSelector(getState())
-
-  if (isPlaying) {
-    dispatch<GlobalPlaybackStopAction>(stopGlobalPlaybackAction())
-  } else {
-    dispatch<GlobalPlaybackStartAction>(startGlobalPlaybackAction())
-  }
-}
+> => (dispatch, getState) => {}
 

[Survived] BlockStatement
src/state/globalPlayback/actions.ts:25:18
 > => (dispatch, getState) => {
   const isPlaying = isPlayingSelector(getState())
 
-  if (isPlaying) {
-    dispatch<GlobalPlaybackStopAction>(stopGlobalPlaybackAction())
-  } else {
+  if (isPlaying) {} else {
     dispatch<GlobalPlaybackStartAction>(startGlobalPlaybackAction())
   }

[Survived] BlockStatement
src/state/globalPlayback/actions.ts:27:10
 
   if (isPlaying) {
     dispatch<GlobalPlaybackStopAction>(stopGlobalPlaybackAction())
-  } else {
-    dispatch<GlobalPlaybackStartAction>(startGlobalPlaybackAction())
-  }
+  } else {}
 }
 
