[Survived] BooleanLiteral
src/state/globalPlayback/reducer.ts:9:56
   isPlaying: boolean
 }
 
-const defaultState: GlobalPlaybackState = { isPlaying: false }
+const defaultState: GlobalPlaybackState = { isPlaying: true }
 
 const globalPlaybackReducer: Reducer<

[Survived] BlockStatement
src/state/globalPlayback/reducer.ts:14:39
 const globalPlaybackReducer: Reducer<
   GlobalPlaybackState,
   GlobalPlaybackAction
-> = (state = defaultState, action) => {
-  switch (action.type) {
-    case 'GLOBAL_PLAYBACK_START':
-      return state.isPlaying ? state : { isPlaying: true }
-    case 'GLOBAL_PLAYBACK_STOP':
-      return state.isPlaying ? { isPlaying: false } : state
-    default:
-      return state
-  }
-}
+> = (state = defaultState, action) => {}
 
 export default globalPlaybackReducer

[Survived] ConditionalExpression
src/state/globalPlayback/reducer.ts:16:5
   GlobalPlaybackAction
 > = (state = defaultState, action) => {
   switch (action.type) {
-    case 'GLOBAL_PLAYBACK_START':
-      return state.isPlaying ? state : { isPlaying: true }
+    case 'GLOBAL_PLAYBACK_START':
     case 'GLOBAL_PLAYBACK_STOP':
       return state.isPlaying ? { isPlaying: false } : state

[Survived] BooleanLiteral
src/state/globalPlayback/reducer.ts:17:53
 > = (state = defaultState, action) => {
   switch (action.type) {
     case 'GLOBAL_PLAYBACK_START':
-      return state.isPlaying ? state : { isPlaying: true }
+      return state.isPlaying ? state : { isPlaying: false }
     case 'GLOBAL_PLAYBACK_STOP':
       return state.isPlaying ? { isPlaying: false } : state

[Survived] ConditionalExpression
src/state/globalPlayback/reducer.ts:18:5
   switch (action.type) {
     case 'GLOBAL_PLAYBACK_START':
       return state.isPlaying ? state : { isPlaying: true }
-    case 'GLOBAL_PLAYBACK_STOP':
-      return state.isPlaying ? { isPlaying: false } : state
+    case 'GLOBAL_PLAYBACK_STOP':
     default:
       return state

[Survived] BooleanLiteral
src/state/globalPlayback/reducer.ts:19:45
     case 'GLOBAL_PLAYBACK_START':
       return state.isPlaying ? state : { isPlaying: true }
     case 'GLOBAL_PLAYBACK_STOP':
-      return state.isPlaying ? { isPlaying: false } : state
+      return state.isPlaying ? { isPlaying: true } : state
     default:
       return state

[Survived] ObjectLiteral
src/state/globalPlayback/reducer.ts:19:32
     case 'GLOBAL_PLAYBACK_START':
       return state.isPlaying ? state : { isPlaying: true }
     case 'GLOBAL_PLAYBACK_STOP':
-      return state.isPlaying ? { isPlaying: false } : state
+      return state.isPlaying ? {} : state
     default:
       return state

[Survived] ConditionalExpression
src/state/globalPlayback/reducer.ts:20:5
       return state.isPlaying ? state : { isPlaying: true }
     case 'GLOBAL_PLAYBACK_STOP':
       return state.isPlaying ? { isPlaying: false } : state
-    default:
-      return state
+    default:
   }
 }
