[Survived] ArrowFunction
src/state/globalPlayback/selectors.ts:6:37
 
 import { ApplicationState } from '~/state/configureStore'
 
-const globalPlaybackStateSelector = (state: ApplicationState) =>
-  state.globalPlayback
+const globalPlaybackStateSelector = () => undefined
 
 export const globalPlaybackSelector = createSelector(
