[Survived] ArrayDeclaration
src/state/hooks/useAudioNode.ts:27:73
 
   const [label, setLabel] = useState('')
   const [audioProps, setAudioProps] = useState<T>(defaultAudioProps)
-  const [connections, setConnections] = useState<AudioNodeConnection[]>([])
+  const [connections, setConnections] = useState<AudioNodeConnection[]>(["Stryker was here"])
   const [isActive, setIsActive] = useState(false)
 

[Survived] BooleanLiteral
src/state/hooks/useAudioNode.ts:28:44
   const [label, setLabel] = useState('')
   const [audioProps, setAudioProps] = useState<T>(defaultAudioProps)
   const [connections, setConnections] = useState<AudioNodeConnection[]>([])
-  const [isActive, setIsActive] = useState(false)
+  const [isActive, setIsActive] = useState(true)
 
   const remove = useCallback(() => dispatch(removeAudioNodeAction(id)), [

[Survived] ArrowFunction
src/state/hooks/useAudioNode.ts:30:30
   const [connections, setConnections] = useState<AudioNodeConnection[]>([])
   const [isActive, setIsActive] = useState(false)
 
-  const remove = useCallback(() => dispatch(removeAudioNodeAction(id)), [
+  const remove = useCallback(() => undefined, [
     id,
     dispatch,

[Survived] ArrayDeclaration
src/state/hooks/useAudioNode.ts:30:73
   const [connections, setConnections] = useState<AudioNodeConnection[]>([])
   const [isActive, setIsActive] = useState(false)
 
-  const remove = useCallback(() => dispatch(removeAudioNodeAction(id)), [
-    id,
-    dispatch,
-  ])
+  const remove = useCallback(() => dispatch(removeAudioNodeAction(id)), [])
 
   const updateAudioProps = useCallback(

[Survived] ArrowFunction
src/state/hooks/useAudioNode.ts:36:5
   ])
 
   const updateAudioProps = useCallback(
-    (audioProps: Partial<T>) =>
-      dispatch(updateAudioNodeAudioPropsAction(id, audioProps)),
+    () => undefined,
     [id, dispatch],
   )

[Survived] ArrowFunction
src/state/hooks/useAudioNode.ts:42:5
   )
 
   const updateLabel = useCallback(
-    (label: string) => dispatch(updateAudioNodeLabelAction(id, label)),
+    () => undefined,
     [id, dispatch],
   )

[Survived] BlockStatement
src/state/hooks/useAudioNode.ts:46:19
     [id, dispatch],
   )
 
-  useEffect(() => {
-    const node = nodes[id]
-
-    if (!node) throw new Error(`Audio node not found at id ${id}`)
-    if (!isValid(node)) throw new Error(`Audio node is invalid for ${id}`)
-
-    setAudioProps(node.audioProps as any) // eslint-disable-line
-    setLabel(node.label)
-  }, [id, nodes, isValid])
+  useEffect(() => {}, [id, nodes, isValid])
 
   useEffect(() => {

[Survived] BooleanLiteral
src/state/hooks/useAudioNode.ts:49:9
   useEffect(() => {
     const node = nodes[id]
 
-    if (!node) throw new Error(`Audio node not found at id ${id}`)
+    if (node) throw new Error(`Audio node not found at id ${id}`)
     if (!isValid(node)) throw new Error(`Audio node is invalid for ${id}`)
 

[Survived] ConditionalExpression
src/state/hooks/useAudioNode.ts:49:9
   useEffect(() => {
     const node = nodes[id]
 
-    if (!node) throw new Error(`Audio node not found at id ${id}`)
+    if (false) throw new Error(`Audio node not found at id ${id}`)
     if (!isValid(node)) throw new Error(`Audio node is invalid for ${id}`)
 

[Survived] ConditionalExpression
src/state/hooks/useAudioNode.ts:50:9
     const node = nodes[id]
 
     if (!node) throw new Error(`Audio node not found at id ${id}`)
-    if (!isValid(node)) throw new Error(`Audio node is invalid for ${id}`)
+    if (true) throw new Error(`Audio node is invalid for ${id}`)
 
     setAudioProps(node.audioProps as any) // eslint-disable-line

[Survived] BooleanLiteral
src/state/hooks/useAudioNode.ts:50:9
     const node = nodes[id]
 
     if (!node) throw new Error(`Audio node not found at id ${id}`)
-    if (!isValid(node)) throw new Error(`Audio node is invalid for ${id}`)
+    if (isValid(node)) throw new Error(`Audio node is invalid for ${id}`)
 
     setAudioProps(node.audioProps as any) // eslint-disable-line

[Survived] BlockStatement
src/state/hooks/useAudioNode.ts:56:19
     setLabel(node.label)
   }, [id, nodes, isValid])
 
-  useEffect(() => {
-    setIsActive(activeIds.includes(id))
-  }, [id, activeIds])
+  useEffect(() => {}, [id, activeIds])
 
   useEffect(() => {

[Survived] BlockStatement
src/state/hooks/useAudioNode.ts:60:19
     setIsActive(activeIds.includes(id))
   }, [id, activeIds])
 
-  useEffect(() => {
-    setConnections(getConnectionsFor(id, allConnections))
-  }, [id, allConnections])
+  useEffect(() => {}, [id, allConnections])
 
   return {

[Survived] ArrayDeclaration
src/state/hooks/useAudioNode.ts:62:6
 
   useEffect(() => {
     setConnections(getConnectionsFor(id, allConnections))
-  }, [id, allConnections])
+  }, [])
 
   return {
