[Survived] BlockStatement
src/state/hooks/useAudioNodes.ts:10:29
 } from '~/state/audioNodes/selectors'
 import { addAudioNodeAction } from '~/state/audioNodes/actions'
 
-const useAudioNodes = () => {
-  const dispatch = useDispatch()
-
-  const nodes = useSelector(audioNodesSelector)
-  const activeIds = useSelector(activeAudioNodeIdsSelector)
-
-  const add = useCallback(
-    (type: string) => dispatch(addAudioNodeAction(type)),
-    [dispatch],
-  )
-
-  return { nodes, activeIds, add }
-}
+const useAudioNodes = () => {}
 
 export default useAudioNodes

[Survived] ArrowFunction
src/state/hooks/useAudioNodes.ts:17:5
   const activeIds = useSelector(activeAudioNodeIdsSelector)
 
   const add = useCallback(
-    (type: string) => dispatch(addAudioNodeAction(type)),
+    () => undefined,
     [dispatch],
   )

[Survived] ArrayDeclaration
src/state/hooks/useAudioNodes.ts:18:5
 
   const add = useCallback(
     (type: string) => dispatch(addAudioNodeAction(type)),
-    [dispatch],
+    [],
   )
 
