[Survived] BlockStatement
src/state/hooks/useAudioNodesMeta.ts:9:33
   immutableAudioEffectsMetaSelector,
 } from '~/state/audioNodes/selectors'
 
-const useAudioNodesMeta = () => {
-  const instruments = useSelector(immutableInstrumentsMetaSelector, equals)
-  const audioEffects = useSelector(immutableAudioEffectsMetaSelector, equals)
-
-  return { instruments, audioEffects }
-}
+const useAudioNodesMeta = () => {}
 
 export default useAudioNodesMeta
