[Survived] BlockStatement
src/state/hooks/useConnections.ts:12:30
 import { connectionsSelector } from '~/state/connections/selectors'
 import { toggleConnectionAction } from '~/state/connections/actions'
 
-const useConnections = () => {
-  const dispatch = useDispatch()
-
-  const sources = useSelector(connectableSourcesSelector)
-  const targets = useSelector(connectableTargetsSelector)
-  const connections = useSelector(connectionsSelector)
-
-  const toggleConnection = useCallback(
-    ({ id: from }: AudioNodeMeta, { id: to }: AudioNodeMeta) =>
-      dispatch(toggleConnectionAction(from, to)),
-    [dispatch],
-  )
-
-  return {
-    connections,
-    sources,
-    targets,
-    toggleConnection,
-  }
-}
+const useConnections = () => {}
 
 export default useConnections

[Survived] ArrowFunction
src/state/hooks/useConnections.ts:20:5
   const connections = useSelector(connectionsSelector)
 
   const toggleConnection = useCallback(
-    ({ id: from }: AudioNodeMeta, { id: to }: AudioNodeMeta) =>
-      dispatch(toggleConnectionAction(from, to)),
+    () => undefined,
     [dispatch],
   )
