[Survived] BlockStatement
src/state/hooks/useGlobalPlayback.ts:7:33
 import { isPlayingSelector } from '~/state/globalPlayback/selectors'
 import { toggleGlobalPlaybackAction } from '~/state/globalPlayback/actions'
 
-const useGlobalPlayback = () => {
-  const dispatch = useDispatch()
-
-  const isPlaying = useSelector(isPlayingSelector)
-
-  const togglePlayback = useCallback(
-    () => dispatch(toggleGlobalPlaybackAction()),
-    [dispatch],
-  )
-
-  return { isPlaying, togglePlayback }
-}
+const useGlobalPlayback = () => {}
 
 export default useGlobalPlayback

[Survived] ArrowFunction
src/state/hooks/useGlobalPlayback.ts:13:5
   const isPlaying = useSelector(isPlayingSelector)
 
   const togglePlayback = useCallback(
-    () => dispatch(toggleGlobalPlaybackAction()),
+    () => undefined,
     [dispatch],
   )
