[Survived] BlockStatement
src/state/hooks/useUITheme.ts:7:26
 import { uiThemeSelector } from '~/state/ui/selectors'
 import { toggleDarkLightUIThemes } from '~/state/ui/actions'
 
-const useUITheme = () => {
-  const dispatch = useDispatch()
-
-  const theme = useSelector(uiThemeSelector)
-
-  const toggleTheme = useCallback(() => dispatch(toggleDarkLightUIThemes()), [
-    dispatch,
-  ])
-
-  return { theme, toggleTheme }
-}
+const useUITheme = () => {}
 
 export default useUITheme

[Survived] ArrowFunction
src/state/hooks/useUITheme.ts:12:35
 
   const theme = useSelector(uiThemeSelector)
 
-  const toggleTheme = useCallback(() => dispatch(toggleDarkLightUIThemes()), [
+  const toggleTheme = useCallback(() => undefined, [
     dispatch,
   ])

[Survived] ArrayDeclaration
src/state/hooks/useUITheme.ts:12:78
 
   const theme = useSelector(uiThemeSelector)
 
-  const toggleTheme = useCallback(() => dispatch(toggleDarkLightUIThemes()), [
-    dispatch,
-  ])
+  const toggleTheme = useCallback(() => dispatch(toggleDarkLightUIThemes()), [])
 
   return { theme, toggleTheme }
