[Survived] ArrowFunction
gleetchy/src/state/serialization.ts:5:22
 
 import { ApplicationState } from '~/state/configureStore'
 
-const isObjectLike = (value: unknown): value is { [key: string]: unknown } =>
-  typeof value === 'object'
+const isObjectLike = () => undefined
 
 const isInstanceOf = curry(

[Survived] EqualityOperator
gleetchy/src/state/serialization.ts:6:16
 import { ApplicationState } from '~/state/configureStore'
 
 const isObjectLike = (value: unknown): value is { [key: string]: unknown } =>
-  typeof value === 'object'
+  typeof value !== 'object'
 
 const isInstanceOf = curry(

[Survived] ConditionalExpression
gleetchy/src/state/serialization.ts:6:3
 import { ApplicationState } from '~/state/configureStore'
 
 const isObjectLike = (value: unknown): value is { [key: string]: unknown } =>
-  typeof value === 'object'
+  true
 
 const isInstanceOf = curry(

[Survived] ArrowFunction
gleetchy/src/state/serialization.ts:9:3
   typeof value === 'object'
 
 const isInstanceOf = curry(
-  (ctor: Function, instance: unknown) => instance instanceof ctor,
+  () => undefined,
 )
 

[Survived] ConditionalExpression
gleetchy/src/state/serialization.ts:9:42
   typeof value === 'object'
 
 const isInstanceOf = curry(
-  (ctor: Function, instance: unknown) => instance instanceof ctor,
+  (ctor: Function, instance: unknown) => false,
 )
 

[Survived] BlockStatement
gleetchy/src/state/serialization.ts:18:59
   isInstanceOf(Error),
 ])
 
-const unsetUnserializable = (struct: unknown): unknown => {
-  if (isUnserializable(struct)) {
-    return undefined
-  }
-
-  if (Array.isArray(struct)) {
-    return (struct as unknown[]).map(unsetUnserializable)
-  }
-
-  if (isObjectLike(struct)) {
-    const copy = { ...struct }
-
-    Object.entries(copy).forEach(([key, value]) => {
-      copy[key] = unsetUnserializable(value)
-    })
-
-    return copy
-  }
-
-  return struct
-}
+const unsetUnserializable = (struct: unknown): unknown => {}
 
 export const serialize: (state: ApplicationState) => string = pipe(

[Survived] ConditionalExpression
gleetchy/src/state/serialization.ts:19:7
 ])
 
 const unsetUnserializable = (struct: unknown): unknown => {
-  if (isUnserializable(struct)) {
+  if (false) {
     return undefined
   }

[Survived] BlockStatement
gleetchy/src/state/serialization.ts:19:33
 ])
 
 const unsetUnserializable = (struct: unknown): unknown => {
-  if (isUnserializable(struct)) {
-    return undefined
-  }
+  if (isUnserializable(struct)) {}
 
   if (Array.isArray(struct)) {

[Survived] ConditionalExpression
gleetchy/src/state/serialization.ts:23:7
     return undefined
   }
 
-  if (Array.isArray(struct)) {
+  if (false) {
     return (struct as unknown[]).map(unsetUnserializable)
   }

[Survived] ConditionalExpression
gleetchy/src/state/serialization.ts:23:7
     return undefined
   }
 
-  if (Array.isArray(struct)) {
+  if (true) {
     return (struct as unknown[]).map(unsetUnserializable)
   }

[Survived] BlockStatement
gleetchy/src/state/serialization.ts:27:29
     return (struct as unknown[]).map(unsetUnserializable)
   }
 
-  if (isObjectLike(struct)) {
-    const copy = { ...struct }
-
-    Object.entries(copy).forEach(([key, value]) => {
-      copy[key] = unsetUnserializable(value)
-    })
-
-    return copy
-  }
+  if (isObjectLike(struct)) {}
 
   return struct

[Survived] ConditionalExpression
gleetchy/src/state/serialization.ts:27:7
     return (struct as unknown[]).map(unsetUnserializable)
   }
 
-  if (isObjectLike(struct)) {
+  if (true) {
     const copy = { ...struct }
 

[Survived] BlockStatement
gleetchy/src/state/serialization.ts:30:52
   if (isObjectLike(struct)) {
     const copy = { ...struct }
 
-    Object.entries(copy).forEach(([key, value]) => {
-      copy[key] = unsetUnserializable(value)
-    })
+    Object.entries(copy).forEach(([key, value]) => {})
 
     return copy

[Survived] StringLiteral
gleetchy/src/state/serialization.ts:41:47
 }
 
 export const serialize: (state: ApplicationState) => string = pipe(
-  pick<keyof ApplicationState>(['audioNodes', 'connections', 'audioFiles']),
+  pick<keyof ApplicationState>(['audioNodes', "", 'audioFiles']),
   (state: Partial<ApplicationState>) =>
     JSON.stringify(unsetUnserializable(state)),

[Survived] StringLiteral
gleetchy/src/state/serialization.ts:41:62
 }
 
 export const serialize: (state: ApplicationState) => string = pipe(
-  pick<keyof ApplicationState>(['audioNodes', 'connections', 'audioFiles']),
+  pick<keyof ApplicationState>(['audioNodes', 'connections', ""]),
   (state: Partial<ApplicationState>) =>
     JSON.stringify(unsetUnserializable(state)),

[Survived] ArrowFunction
gleetchy/src/state/serialization.ts:42:3
 
 export const serialize: (state: ApplicationState) => string = pipe(
   pick<keyof ApplicationState>(['audioNodes', 'connections', 'audioFiles']),
-  (state: Partial<ApplicationState>) =>
-    JSON.stringify(unsetUnserializable(state)),
+  () => undefined,
 )
 

[Survived] ArrowFunction
gleetchy/src/state/serialization.ts:46:28
     JSON.stringify(unsetUnserializable(state)),
 )
 
-export const deserialize = (stateString: string) => JSON.parse(stateString)
+export const deserialize = () => undefined
 
