[Survived] ArrowFunction
src/state/ui/actions.ts:7:40
 import { UISetThemeAction } from './types'
 import { uiThemeNameSelector } from './selectors'
 
-export const toggleDarkLightUIThemes = (): ThunkAction<
-  void,
-  ApplicationState,
-  undefined,
-  UISetThemeAction
-> => (dispatch, getState) => {
-  const themeName = uiThemeNameSelector(getState())
-
-  if (themeName === 'dark') {
-    dispatch<UISetThemeAction>({ payload: 'light', type: 'UI_SET_THEME' })
-  } else {
-    dispatch<UISetThemeAction>({ payload: 'dark', type: 'UI_SET_THEME' })
-  }
-}
+export const toggleDarkLightUIThemes = () => undefined
 

[Survived] BlockStatement
src/state/ui/actions.ts:12:30
   ApplicationState,
   undefined,
   UISetThemeAction
-> => (dispatch, getState) => {
-  const themeName = uiThemeNameSelector(getState())
-
-  if (themeName === 'dark') {
-    dispatch<UISetThemeAction>({ payload: 'light', type: 'UI_SET_THEME' })
-  } else {
-    dispatch<UISetThemeAction>({ payload: 'dark', type: 'UI_SET_THEME' })
-  }
-}
+> => (dispatch, getState) => {}
 

[Survived] BlockStatement
src/state/ui/actions.ts:15:29
 > => (dispatch, getState) => {
   const themeName = uiThemeNameSelector(getState())
 
-  if (themeName === 'dark') {
-    dispatch<UISetThemeAction>({ payload: 'light', type: 'UI_SET_THEME' })
-  } else {
+  if (themeName === 'dark') {} else {
     dispatch<UISetThemeAction>({ payload: 'dark', type: 'UI_SET_THEME' })
   }

[Survived] ConditionalExpression
src/state/ui/actions.ts:15:7
 > => (dispatch, getState) => {
   const themeName = uiThemeNameSelector(getState())
 
-  if (themeName === 'dark') {
+  if (false) {
     dispatch<UISetThemeAction>({ payload: 'light', type: 'UI_SET_THEME' })
   } else {

[Survived] StringLiteral
src/state/ui/actions.ts:16:43
   const themeName = uiThemeNameSelector(getState())
 
   if (themeName === 'dark') {
-    dispatch<UISetThemeAction>({ payload: 'light', type: 'UI_SET_THEME' })
+    dispatch<UISetThemeAction>({ payload: "", type: 'UI_SET_THEME' })
   } else {
     dispatch<UISetThemeAction>({ payload: 'dark', type: 'UI_SET_THEME' })

[Survived] BlockStatement
src/state/ui/actions.ts:17:10
 
   if (themeName === 'dark') {
     dispatch<UISetThemeAction>({ payload: 'light', type: 'UI_SET_THEME' })
-  } else {
-    dispatch<UISetThemeAction>({ payload: 'dark', type: 'UI_SET_THEME' })
-  }
+  } else {}
 }
 

[Survived] StringLiteral
src/state/ui/actions.ts:18:43
   if (themeName === 'dark') {
     dispatch<UISetThemeAction>({ payload: 'light', type: 'UI_SET_THEME' })
   } else {
-    dispatch<UISetThemeAction>({ payload: 'dark', type: 'UI_SET_THEME' })
+    dispatch<UISetThemeAction>({ payload: "", type: 'UI_SET_THEME' })
   }
 }

[Survived] ObjectLiteral
src/state/ui/actions.ts:18:32
   if (themeName === 'dark') {
     dispatch<UISetThemeAction>({ payload: 'light', type: 'UI_SET_THEME' })
   } else {
-    dispatch<UISetThemeAction>({ payload: 'dark', type: 'UI_SET_THEME' })
+    dispatch<UISetThemeAction>({})
   }
 }
