[Survived] BlockStatement
src/state/ui/reducer.ts:19:15
 const UIReducer: Reducer<UIState, UIAction> = (
   state = defaultState,
   action,
-): UIState => {
-  switch (action.type) {
-    case 'UI_SET_THEME':
-      return produce<UIState>(state, draftState => {
-        draftState.currentThemeName = action.payload
-      })
-    default:
-      return state
-  }
-}
+): UIState => {}
 
 export default UIReducer

[Survived] ConditionalExpression
src/state/ui/reducer.ts:21:5
   action,
 ): UIState => {
   switch (action.type) {
-    case 'UI_SET_THEME':
-      return produce<UIState>(state, draftState => {
-        draftState.currentThemeName = action.payload
-      })
+    case 'UI_SET_THEME':
     default:
       return state

[Survived] StringLiteral
src/state/ui/reducer.ts:21:10
   action,
 ): UIState => {
   switch (action.type) {
-    case 'UI_SET_THEME':
+    case "":
       return produce<UIState>(state, draftState => {
         draftState.currentThemeName = action.payload

[Survived] BlockStatement
src/state/ui/reducer.ts:22:52
 ): UIState => {
   switch (action.type) {
     case 'UI_SET_THEME':
-      return produce<UIState>(state, draftState => {
-        draftState.currentThemeName = action.payload
-      })
+      return produce<UIState>(state, draftState => {})
     default:
       return state
