[Survived] ArrowFunction
src/state/ui/selectors.ts:9:3
 
 const getTheme = memoizeWith(
   identity,
-  (themeName: ThemeName) =>
-    themes.find(theme => theme.name === themeName) || themes[0],
+  () => undefined,
 )
 

[Survived] ConditionalExpression
src/state/ui/selectors.ts:10:26
 const getTheme = memoizeWith(
   identity,
   (themeName: ThemeName) =>
-    themes.find(theme => theme.name === themeName) || themes[0],
+    themes.find(theme => false) || themes[0],
 )
 

[Survived] ConditionalExpression
src/state/ui/selectors.ts:10:26
 const getTheme = memoizeWith(
   identity,
   (themeName: ThemeName) =>
-    themes.find(theme => theme.name === themeName) || themes[0],
+    themes.find(theme => true) || themes[0],
 )
 

[Survived] ArrowFunction
src/state/ui/selectors.ts:13:25
     themes.find(theme => theme.name === themeName) || themes[0],
 )
 
-const uiStateSelector = (state: ApplicationState) => state.ui
+const uiStateSelector = () => undefined
 
 export const uiThemeNameSelector = createSelector(

[Survived] ArrowFunction
src/state/ui/selectors.ts:17:3
 
 export const uiThemeNameSelector = createSelector(
   uiStateSelector,
-  ({ currentThemeName }) => currentThemeName,
+  () => undefined,
 )
 

[Survived] ArrowFunction
src/state/ui/selectors.ts:20:68
   ({ currentThemeName }) => currentThemeName,
 )
 
-export const uiThemeSelector = createSelector(uiThemeNameSelector, themeName =>
-  getTheme(themeName),
+export const uiThemeSelector = createSelector(uiThemeNameSelector, () => undefined,
 )
 
