[Survived] StringLiteral
gleetchy/src/style/color.ts:2:11
 export const asciiBlockFills = {
-  sparse: '░',
+  sparse: "",
   medium: '▒',
   dense: '▓',

[Survived] StringLiteral
gleetchy/src/style/color.ts:3:11
 export const asciiBlockFills = {
   sparse: '░',
-  medium: '▒',
+  medium: "",
   dense: '▓',
   full: '█',

[Survived] StringLiteral
gleetchy/src/style/color.ts:6:16
   medium: '▒',
   dense: '▓',
   full: '█',
-  fullTopHalf: '▀',
+  fullTopHalf: "",
   fullRightHalf: '▐',
   fullBottomHalf: '▄',

[Survived] StringLiteral
gleetchy/src/style/color.ts:8:19
   full: '█',
   fullTopHalf: '▀',
   fullRightHalf: '▐',
-  fullBottomHalf: '▄',
+  fullBottomHalf: "",
   fullLeftHalf: '▌',
 }

[Survived] StringLiteral
gleetchy/src/style/color.ts:15:3
 export const nodeColorPool = [
   '#6994d0',
   '#b7cce8',
-  '#b7cce8',
+  "",
   '#b9dba4',
   '#9dcc80',

[Survived] StringLiteral
gleetchy/src/style/color.ts:22:3
   '#f6ca38',
   '#f8d769',
   '#fae49a',
-  '#f6c696',
+  "",
   '#f2ac67',
   '#ee9238',

[Survived] StringLiteral
gleetchy/src/style/color.ts:25:3
   '#f6c696',
   '#f2ac67',
   '#ee9238',
-  '#e63a37',
+  "",
   '#ec6764',
   '#f29491',

[Survived] StringLiteral
gleetchy/src/style/color.ts:30:3
   '#f29491',
   '#cda1ca',
   '#bb80b7',
-  '#a95fa4',
+  "",
   '#db7194',
   '#e59ab3',

[Survived] StringLiteral
gleetchy/src/style/color.ts:32:3
   '#bb80b7',
   '#a95fa4',
   '#db7194',
-  '#e59ab3',
+  "",
   '#efc3d2',
   '#93586f',

[Survived] StringLiteral
gleetchy/src/style/color.ts:34:3
   '#db7194',
   '#e59ab3',
   '#efc3d2',
-  '#93586f',
+  "",
   '#51489d',
   '#9b3333',

[Survived] StringLiteral
gleetchy/src/style/color.ts:36:3
   '#efc3d2',
   '#93586f',
   '#51489d',
-  '#9b3333',
+  "",
   '#9e6627',
   '#d1592f',

[Survived] StringLiteral
gleetchy/src/style/color.ts:39:3
   '#9b3333',
   '#9e6627',
   '#d1592f',
-  '#fab599',
+  "",
   '#a5c4ad',
   '#748978',

[Survived] StringLiteral
gleetchy/src/style/color.ts:40:3
   '#9e6627',
   '#d1592f',
   '#fab599',
-  '#a5c4ad',
+  "",
   '#748978',
   '#698755',

[Survived] StringLiteral
gleetchy/src/style/color.ts:41:3
   '#d1592f',
   '#fab599',
   '#a5c4ad',
-  '#748978',
+  "",
   '#698755',
   '#42668e',

[Survived] StringLiteral
gleetchy/src/style/color.ts:44:3
   '#748978',
   '#698755',
   '#42668e',
-  '#12739e',
+  "",
   '#96d0e2',
 ].sort(() => Math.floor(Math.random() * 3) - 1)

[Survived] StringLiteral
gleetchy/src/style/color.ts:45:3
   '#698755',
   '#42668e',
   '#12739e',
-  '#96d0e2',
+  "",
 ].sort(() => Math.floor(Math.random() * 3) - 1)
 

[Survived] ArithmeticOperator
gleetchy/src/style/color.ts:46:44
   '#42668e',
   '#12739e',
   '#96d0e2',
-].sort(() => Math.floor(Math.random() * 3) - 1)
+].sort(() => Math.floor(Math.random() * 3) + 1)
 

[Survived] ArrowFunction
gleetchy/src/style/color.ts:46:8
   '#42668e',
   '#12739e',
   '#96d0e2',
-].sort(() => Math.floor(Math.random() * 3) - 1)
+].sort(() => undefined)
 
