[Survived] ObjectLiteral
gleetchy/src/style/layout.ts:3:39
 import { css } from '@emotion/core'
 
-export const layoutAbsoluteFill = css({
-  position: 'absolute',
-  top: 0,
-  right: 0,
-  bottom: 0,
-  left: 0,
-})
+export const layoutAbsoluteFill = css({})
 
