[Survived] StringLiteral
gleetchy/src/style/theme.ts:31:16
     ...common,
     name: 'light',
     colorPage: '#fff',
-    colorBody: '#222',
+    colorBody: "",
     colorEmphasis: '#000',
     colorKeyline: '#e8e8e8',

[Survived] StringLiteral
gleetchy/src/style/theme.ts:33:19
     colorPage: '#fff',
     colorBody: '#222',
     colorEmphasis: '#000',
-    colorKeyline: '#e8e8e8',
+    colorKeyline: "",
     colorError: '#ec6764',
   },
