[Killed] ArrowFunction
gleetchy/src/util/audio.ts:5:23
 
 import { AudioNodeConnection, AudioNodeMeta } from '~/types'
 
-const typeSatisfies = (pred: (type: string) => boolean) =>
-  tryCatch(propSatisfies<string>(pred, 'type'), F)
+const typeSatisfies = () => undefined
 
 export const isAudioEffect = typeSatisfies(test(/^audio_effect_/i))

[Killed] StringLiteral
gleetchy/src/util/audio.ts:6:40
 import { AudioNodeConnection, AudioNodeMeta } from '~/types'
 
 const typeSatisfies = (pred: (type: string) => boolean) =>
-  tryCatch(propSatisfies<string>(pred, 'type'), F)
+  tryCatch(propSatisfies<string>(pred, ""), F)
 
 export const isAudioEffect = typeSatisfies(test(/^audio_effect_/i))

[Killed] ArrowFunction
gleetchy/src/util/audio.ts:15:3
 type Connection = Omit<AudioNodeConnection, 'color'>
 
 export const isSameConnection = curry(
-  (connection1: Connection, connection2: Connection) =>
-    connection1.from === connection2.from && connection1.to === connection2.to,
+  () => undefined,
 )
 

[Killed] ConditionalExpression
gleetchy/src/util/audio.ts:16:5
 
 export const isSameConnection = curry(
   (connection1: Connection, connection2: Connection) =>
-    connection1.from === connection2.from && connection1.to === connection2.to,
+    false,
 )
 

[Killed] ConditionalExpression
gleetchy/src/util/audio.ts:16:5
 
 export const isSameConnection = curry(
   (connection1: Connection, connection2: Connection) =>
-    connection1.from === connection2.from && connection1.to === connection2.to,
+    false && connection1.to === connection2.to,
 )
 

[Killed] ArrowFunction
gleetchy/src/util/audio.ts:20:3
 )
 
 export const getConnectionsFor = curry(
-  (id: string, connections: AudioNodeConnection[]): AudioNodeConnection[] =>
-    connections.filter(({ from, to }) => from === id || to === id),
+  () => undefined,
 )
 

[Killed] ArrowFunction
gleetchy/src/util/audio.ts:21:24
 
 export const getConnectionsFor = curry(
   (id: string, connections: AudioNodeConnection[]): AudioNodeConnection[] =>
-    connections.filter(({ from, to }) => from === id || to === id),
+    connections.filter(() => undefined),
 )
 

[Killed] ConditionalExpression
gleetchy/src/util/audio.ts:21:57
 
 export const getConnectionsFor = curry(
   (id: string, connections: AudioNodeConnection[]): AudioNodeConnection[] =>
-    connections.filter(({ from, to }) => from === id || to === id),
+    connections.filter(({ from, to }) => from === id || true),
 )
 

[Killed] BlockStatement
gleetchy/src/util/audio.ts:25:64
 )
 
 export const hasConnectionTo = curry(
-  (connections: Connection[], toId: string, fromId: string) => {
-    if (!connections.length) return false
-
-    const checkDownstreamConnection = (innerFromId: string): boolean => {
-      const connectionsFromId = connections.filter(propEq('from', innerFromId))
-
-      if (!connectionsFromId.length) return false
-      if (connectionsFromId.some(propEq('to', toId))) return true
-
-      return connectionsFromId.reduce(
-        (accum: boolean, connection) =>
-          accum || checkDownstreamConnection(connection.to),
-        false,
-      )
-    }
-
-    return checkDownstreamConnection(fromId)
-  },
+  (connections: Connection[], toId: string, fromId: string) => {},
 )
 

[Killed] ConditionalExpression
gleetchy/src/util/audio.ts:26:9
 
 export const hasConnectionTo = curry(
   (connections: Connection[], toId: string, fromId: string) => {
-    if (!connections.length) return false
+    if (true) return false
 
     const checkDownstreamConnection = (innerFromId: string): boolean => {

[Killed] BooleanLiteral
gleetchy/src/util/audio.ts:26:9
 
 export const hasConnectionTo = curry(
   (connections: Connection[], toId: string, fromId: string) => {
-    if (!connections.length) return false
+    if (connections.length) return false
 
     const checkDownstreamConnection = (innerFromId: string): boolean => {

[Killed] BlockStatement
gleetchy/src/util/audio.ts:28:73
   (connections: Connection[], toId: string, fromId: string) => {
     if (!connections.length) return false
 
-    const checkDownstreamConnection = (innerFromId: string): boolean => {
-      const connectionsFromId = connections.filter(propEq('from', innerFromId))
-
-      if (!connectionsFromId.length) return false
-      if (connectionsFromId.some(propEq('to', toId))) return true
-
-      return connectionsFromId.reduce(
-        (accum: boolean, connection) =>
-          accum || checkDownstreamConnection(connection.to),
-        false,
-      )
-    }
+    const checkDownstreamConnection = (innerFromId: string): boolean => {}
 
     return checkDownstreamConnection(fromId)

[Killed] BooleanLiteral
gleetchy/src/util/audio.ts:31:11
     const checkDownstreamConnection = (innerFromId: string): boolean => {
       const connectionsFromId = connections.filter(propEq('from', innerFromId))
 
-      if (!connectionsFromId.length) return false
+      if (connectionsFromId.length) return false
       if (connectionsFromId.some(propEq('to', toId))) return true
 

[Killed] ConditionalExpression
gleetchy/src/util/audio.ts:31:11
     const checkDownstreamConnection = (innerFromId: string): boolean => {
       const connectionsFromId = connections.filter(propEq('from', innerFromId))
 
-      if (!connectionsFromId.length) return false
+      if (true) return false
       if (connectionsFromId.some(propEq('to', toId))) return true
 

[Killed] ConditionalExpression
gleetchy/src/util/audio.ts:32:11
       const connectionsFromId = connections.filter(propEq('from', innerFromId))
 
       if (!connectionsFromId.length) return false
-      if (connectionsFromId.some(propEq('to', toId))) return true
+      if (false) return true
 
       return connectionsFromId.reduce(

[Killed] BooleanLiteral
gleetchy/src/util/audio.ts:32:62
       const connectionsFromId = connections.filter(propEq('from', innerFromId))
 
       if (!connectionsFromId.length) return false
-      if (connectionsFromId.some(propEq('to', toId))) return true
+      if (connectionsFromId.some(propEq('to', toId))) return false
 
       return connectionsFromId.reduce(

[Killed] ArrowFunction
gleetchy/src/util/audio.ts:35:9
       if (connectionsFromId.some(propEq('to', toId))) return true
 
       return connectionsFromId.reduce(
-        (accum: boolean, connection) =>
-          accum || checkDownstreamConnection(connection.to),
+        () => undefined,
         false,
       )

[Killed] LogicalOperator
gleetchy/src/util/audio.ts:36:17
 
       return connectionsFromId.reduce(
         (accum: boolean, connection) =>
-          accum || checkDownstreamConnection(connection.to),
+          accum && checkDownstreamConnection(connection.to),
         false,
       )

[Killed] ConditionalExpression
gleetchy/src/util/audio.ts:36:11
 
       return connectionsFromId.reduce(
         (accum: boolean, connection) =>
-          accum || checkDownstreamConnection(connection.to),
+          true,
         false,
       )

[Killed] BooleanLiteral
gleetchy/src/util/audio.ts:37:9
       return connectionsFromId.reduce(
         (accum: boolean, connection) =>
           accum || checkDownstreamConnection(connection.to),
-        false,
+        true,
       )
     }

[Killed] ArrowFunction
gleetchy/src/util/audio.ts:46:3
 )
 
 export const canConnectNodes = curry(
-  (
-    connections: Connection[],
-    { id: fromId }: Pick<AudioNodeMeta, 'id'>,
-    { id: toId }: Pick<AudioNodeMeta, 'id'>,
-  ) => fromId !== toId && !hasConnectionTo(connections, fromId, toId),
+  () => undefined,
 )
 

[Killed] EqualityOperator
gleetchy/src/util/audio.ts:50:15
     connections: Connection[],
     { id: fromId }: Pick<AudioNodeMeta, 'id'>,
     { id: toId }: Pick<AudioNodeMeta, 'id'>,
-  ) => fromId !== toId && !hasConnectionTo(connections, fromId, toId),
+  ) => fromId === toId && !hasConnectionTo(connections, fromId, toId),
 )
 

[Killed] BooleanLiteral
gleetchy/src/util/audio.ts:50:27
     connections: Connection[],
     { id: fromId }: Pick<AudioNodeMeta, 'id'>,
     { id: toId }: Pick<AudioNodeMeta, 'id'>,
-  ) => fromId !== toId && !hasConnectionTo(connections, fromId, toId),
+  ) => fromId !== toId && hasConnectionTo(connections, fromId, toId),
 )
 

[Killed] ArrowFunction
gleetchy/src/util/audio.ts:54:3
 )
 
 export const getConnectionBetween = curry(
-  (
-    connections: AudioNodeConnection[],
-    { id: from }: Pick<AudioNodeMeta, 'id'>,
-    { id: to }: Pick<AudioNodeMeta, 'id'>,
-  ) => connections.find(isSameConnection({ from, to })),
+  () => undefined,
 )
 
