[Killed] ArrowFunction
gleetchy/src/util/connection.ts:3:23
 import { AudioNodeConnectableProxy, AudioNodeReturn, GAudioNode } from '~/types'
 
-const createConnect = (getOutNode: AudioNodeReturn) =>
-  function connect(node: AudioNode | AudioNodeConnectableProxy) {
-    const outNode = getOutNode()
-
-    if (node instanceof AudioNode) {
-      outNode.connect(node)
-    } else if (typeof node.getInNode === 'function') {
-      outNode.connect(node.getInNode())
-    } else {
-      throw new Error('Unable to connect to node')
-    }
-  }
+const createConnect = () => undefined
 
 const createDisconnect = (getOutNode: AudioNodeReturn) =>

[Survived] BlockStatement
gleetchy/src/util/connection.ts:4:65
 import { AudioNodeConnectableProxy, AudioNodeReturn, GAudioNode } from '~/types'
 
 const createConnect = (getOutNode: AudioNodeReturn) =>
-  function connect(node: AudioNode | AudioNodeConnectableProxy) {
-    const outNode = getOutNode()
-
-    if (node instanceof AudioNode) {
-      outNode.connect(node)
-    } else if (typeof node.getInNode === 'function') {
-      outNode.connect(node.getInNode())
-    } else {
-      throw new Error('Unable to connect to node')
-    }
-  }
+  function connect(node: AudioNode | AudioNodeConnectableProxy) {}
 
 const createDisconnect = (getOutNode: AudioNodeReturn) =>

[Survived] ConditionalExpression
gleetchy/src/util/connection.ts:7:9
   function connect(node: AudioNode | AudioNodeConnectableProxy) {
     const outNode = getOutNode()
 
-    if (node instanceof AudioNode) {
+    if (false) {
       outNode.connect(node)
     } else if (typeof node.getInNode === 'function') {

[Survived] BlockStatement
gleetchy/src/util/connection.ts:7:36
   function connect(node: AudioNode | AudioNodeConnectableProxy) {
     const outNode = getOutNode()
 
-    if (node instanceof AudioNode) {
-      outNode.connect(node)
-    } else if (typeof node.getInNode === 'function') {
+    if (node instanceof AudioNode) {} else if (typeof node.getInNode === 'function') {
       outNode.connect(node.getInNode())
     } else {

[Survived] ConditionalExpression
gleetchy/src/util/connection.ts:9:16
 
     if (node instanceof AudioNode) {
       outNode.connect(node)
-    } else if (typeof node.getInNode === 'function') {
+    } else if (false) {
       outNode.connect(node.getInNode())
     } else {

[Survived] ConditionalExpression
gleetchy/src/util/connection.ts:9:16
 
     if (node instanceof AudioNode) {
       outNode.connect(node)
-    } else if (typeof node.getInNode === 'function') {
+    } else if (true) {
       outNode.connect(node.getInNode())
     } else {

[Survived] BlockStatement
gleetchy/src/util/connection.ts:11:12
       outNode.connect(node)
     } else if (typeof node.getInNode === 'function') {
       outNode.connect(node.getInNode())
-    } else {
-      throw new Error('Unable to connect to node')
-    }
+    } else {}
   }
 

[Killed] ArrowFunction
gleetchy/src/util/connection.ts:16:26
     }
   }
 
-const createDisconnect = (getOutNode: AudioNodeReturn) =>
-  function disconnect(node: AudioNode | AudioNodeConnectableProxy) {
-    const outNode = getOutNode()
-
-    if (!node) {
-      outNode.disconnect()
-    } else if (node instanceof AudioNode) {
-      outNode.disconnect(node)
-    } else if (typeof node.getInNode === 'function') {
-      outNode.disconnect(node.getInNode())
-    } else {
-      throw new Error('Unable to disconnect node')
-    }
-  }
+const createDisconnect = () => undefined
 
 export const connectable = <

[Survived] BlockStatement
gleetchy/src/util/connection.ts:17:68
   }
 
 const createDisconnect = (getOutNode: AudioNodeReturn) =>
-  function disconnect(node: AudioNode | AudioNodeConnectableProxy) {
-    const outNode = getOutNode()
-
-    if (!node) {
-      outNode.disconnect()
-    } else if (node instanceof AudioNode) {
-      outNode.disconnect(node)
-    } else if (typeof node.getInNode === 'function') {
-      outNode.disconnect(node.getInNode())
-    } else {
-      throw new Error('Unable to disconnect node')
-    }
-  }
+  function disconnect(node: AudioNode | AudioNodeConnectableProxy) {}
 
 export const connectable = <

[Survived] ConditionalExpression
gleetchy/src/util/connection.ts:20:9
   function disconnect(node: AudioNode | AudioNodeConnectableProxy) {
     const outNode = getOutNode()
 
-    if (!node) {
+    if (false) {
       outNode.disconnect()
     } else if (node instanceof AudioNode) {

[Survived] BooleanLiteral
gleetchy/src/util/connection.ts:20:9
   function disconnect(node: AudioNode | AudioNodeConnectableProxy) {
     const outNode = getOutNode()
 
-    if (!node) {
+    if (node) {
       outNode.disconnect()
     } else if (node instanceof AudioNode) {

[Survived] ConditionalExpression
gleetchy/src/util/connection.ts:22:16
 
     if (!node) {
       outNode.disconnect()
-    } else if (node instanceof AudioNode) {
+    } else if (true) {
       outNode.disconnect(node)
     } else if (typeof node.getInNode === 'function') {

[Survived] ConditionalExpression
gleetchy/src/util/connection.ts:22:16
 
     if (!node) {
       outNode.disconnect()
-    } else if (node instanceof AudioNode) {
+    } else if (false) {
       outNode.disconnect(node)
     } else if (typeof node.getInNode === 'function') {

[Survived] BlockStatement
gleetchy/src/util/connection.ts:24:54
       outNode.disconnect()
     } else if (node instanceof AudioNode) {
       outNode.disconnect(node)
-    } else if (typeof node.getInNode === 'function') {
-      outNode.disconnect(node.getInNode())
-    } else {
+    } else if (typeof node.getInNode === 'function') {} else {
       throw new Error('Unable to disconnect node')
     }

[Survived] ConditionalExpression
gleetchy/src/util/connection.ts:24:16
       outNode.disconnect()
     } else if (node instanceof AudioNode) {
       outNode.disconnect(node)
-    } else if (typeof node.getInNode === 'function') {
+    } else if (true) {
       outNode.disconnect(node.getInNode())
     } else {

[Survived] BlockStatement
gleetchy/src/util/connection.ts:26:12
       outNode.disconnect(node)
     } else if (typeof node.getInNode === 'function') {
       outNode.disconnect(node.getInNode())
-    } else {
-      throw new Error('Unable to disconnect node')
-    }
+    } else {}
   }
 

[Killed] ArrowFunction
gleetchy/src/util/connection.ts:31:28
     }
   }
 
-export const connectable = <
-  // eslint-disable-next-line @typescript-eslint/no-explicit-any
-  P extends object = any,
-  N extends GAudioNode = GAudioNode<P, string>
->({
-  getInNode,
-  getOutNode,
-}: // eslint-disable-next-line @typescript-eslint/no-explicit-any
-AudioNodeConnectableProxy) => (api: any): N =>
-  Object.assign(api, {
-    connect: createConnect(getOutNode),
-    disconnect: createDisconnect(getOutNode),
-    getInNode,
-    getOutNode,
-  })
+export const connectable = () => undefined
 

[Killed] ArrowFunction
gleetchy/src/util/connection.ts:39:31
   getInNode,
   getOutNode,
 }: // eslint-disable-next-line @typescript-eslint/no-explicit-any
-AudioNodeConnectableProxy) => (api: any): N =>
-  Object.assign(api, {
-    connect: createConnect(getOutNode),
-    disconnect: createDisconnect(getOutNode),
-    getInNode,
-    getOutNode,
-  })
+AudioNodeConnectableProxy) => () => undefined
 
