[Survived] EqualityOperator
gleetchy/src/util/dev.ts:4:36
 /* eslint-disable no-console */
 import { noop } from './function'
 
-const isDev = process.env.NODE_ENV !== 'production'
+const isDev = process.env.NODE_ENV === 'production'
 const cLog = console.log.bind(console)
 const cWarn = console.warn.bind(console)

[Survived] ConditionalExpression
gleetchy/src/util/dev.ts:4:15
 /* eslint-disable no-console */
 import { noop } from './function'
 
-const isDev = process.env.NODE_ENV !== 'production'
+const isDev = false
 const cLog = console.log.bind(console)
 const cWarn = console.warn.bind(console)
