[Killed] BlockStatement
gleetchy/src/util/env.ts:5:64
 
 import { isNotNil } from './object'
 
-export const requireWindowWith = (propPaths: string[] = []) => {
-  const WINDOW = typeof window !== 'undefined' ? window : undefined
-
-  if (!WINDOW) {
-    return undefined
-  }
-
-  const windowHas = pipe(split('.'), path(__, WINDOW), isNotNil)
-
-  return propPaths.every(windowHas) ? WINDOW : undefined
-}
+export const requireWindowWith = (propPaths: string[] = []) => {}
 
 const asEventName = (name: string) =>

[Survived] ArrayDeclaration
gleetchy/src/util/env.ts:5:57
 
 import { isNotNil } from './object'
 
-export const requireWindowWith = (propPaths: string[] = []) => {
+export const requireWindowWith = (propPaths: string[] = ["Stryker was here"]) => {
   const WINDOW = typeof window !== 'undefined' ? window : undefined
 

[Killed] ConditionalExpression
gleetchy/src/util/env.ts:6:18
 import { isNotNil } from './object'
 
 export const requireWindowWith = (propPaths: string[] = []) => {
-  const WINDOW = typeof window !== 'undefined' ? window : undefined
+  const WINDOW = false ? window : undefined
 
   if (!WINDOW) {

[Killed] EqualityOperator
gleetchy/src/util/env.ts:6:32
 import { isNotNil } from './object'
 
 export const requireWindowWith = (propPaths: string[] = []) => {
-  const WINDOW = typeof window !== 'undefined' ? window : undefined
+  const WINDOW = typeof window === 'undefined' ? window : undefined
 
   if (!WINDOW) {

[Killed] ConditionalExpression
gleetchy/src/util/env.ts:8:7
 export const requireWindowWith = (propPaths: string[] = []) => {
   const WINDOW = typeof window !== 'undefined' ? window : undefined
 
-  if (!WINDOW) {
+  if (true) {
     return undefined
   }

[Killed] ArrowFunction
gleetchy/src/util/env.ts:17:21
   return propPaths.every(windowHas) ? WINDOW : undefined
 }
 
-const asEventName = (name: string) =>
-  name.startsWith('on') ? name.slice(2) : name
+const asEventName = () => undefined
 
 const isSupportedEvent = (name: string) => {

[Killed] StringLiteral
gleetchy/src/util/env.ts:18:19
 }
 
 const asEventName = (name: string) =>
-  name.startsWith('on') ? name.slice(2) : name
+  name.startsWith("") ? name.slice(2) : name
 
 const isSupportedEvent = (name: string) => {

[Killed] BlockStatement
gleetchy/src/util/env.ts:20:44
 const asEventName = (name: string) =>
   name.startsWith('on') ? name.slice(2) : name
 
-const isSupportedEvent = (name: string) => {
-  const asHandlerName = name.startsWith('on') ? name : `on${name}`
-  const WINDOW = requireWindowWith(['document.documentElement'])
-
-  return WINDOW
-    ? asHandlerName in WINDOW.document ||
-        asHandlerName in WINDOW.document.documentElement
-    : false
-}
+const isSupportedEvent = (name: string) => {}
 
 export const filterSupportedEvents = (eventNames: string[]) =>

[Survived] StringLiteral
gleetchy/src/util/env.ts:21:41
   name.startsWith('on') ? name.slice(2) : name
 
 const isSupportedEvent = (name: string) => {
-  const asHandlerName = name.startsWith('on') ? name : `on${name}`
+  const asHandlerName = name.startsWith("") ? name : `on${name}`
   const WINDOW = requireWindowWith(['document.documentElement'])
 

[Killed] ConditionalExpression
gleetchy/src/util/env.ts:25:7
   const WINDOW = requireWindowWith(['document.documentElement'])
 
   return WINDOW
-    ? asHandlerName in WINDOW.document ||
-        asHandlerName in WINDOW.document.documentElement
+    ? true
     : false
 }

[Killed] ConditionalExpression
gleetchy/src/util/env.ts:25:7
   const WINDOW = requireWindowWith(['document.documentElement'])
 
   return WINDOW
-    ? asHandlerName in WINDOW.document ||
+    ? true ||
         asHandlerName in WINDOW.document.documentElement
     : false

[Killed] ConditionalExpression
gleetchy/src/util/env.ts:26:9
 
   return WINDOW
     ? asHandlerName in WINDOW.document ||
-        asHandlerName in WINDOW.document.documentElement
+        true
     : false
 }

[Survived] ConditionalExpression
gleetchy/src/util/env.ts:26:9
 
   return WINDOW
     ? asHandlerName in WINDOW.document ||
-        asHandlerName in WINDOW.document.documentElement
+        false
     : false
 }

[Survived] BooleanLiteral
gleetchy/src/util/env.ts:27:7
   return WINDOW
     ? asHandlerName in WINDOW.document ||
         asHandlerName in WINDOW.document.documentElement
-    : false
+    : true
 }
 

[Killed] ArrowFunction
gleetchy/src/util/env.ts:30:38
     : false
 }
 
-export const filterSupportedEvents = (eventNames: string[]) =>
-  uniq(
-    eventNames.reduce((acc: string[], name) => {
-      if (isSupportedEvent(name)) acc.push(asEventName(name))
-      return acc
-    }, []),
-  )
+export const filterSupportedEvents = () => undefined
 

[Killed] BlockStatement
gleetchy/src/util/env.ts:32:48
 
 export const filterSupportedEvents = (eventNames: string[]) =>
   uniq(
-    eventNames.reduce((acc: string[], name) => {
-      if (isSupportedEvent(name)) acc.push(asEventName(name))
-      return acc
-    }, []),
+    eventNames.reduce((acc: string[], name) => {}, []),
   )
 

[Killed] ConditionalExpression
gleetchy/src/util/env.ts:33:11
 export const filterSupportedEvents = (eventNames: string[]) =>
   uniq(
     eventNames.reduce((acc: string[], name) => {
-      if (isSupportedEvent(name)) acc.push(asEventName(name))
+      if (false) acc.push(asEventName(name))
       return acc
     }, []),

[Killed] ConditionalExpression
gleetchy/src/util/env.ts:33:11
 export const filterSupportedEvents = (eventNames: string[]) =>
   uniq(
     eventNames.reduce((acc: string[], name) => {
-      if (isSupportedEvent(name)) acc.push(asEventName(name))
+      if (true) acc.push(asEventName(name))
       return acc
     }, []),

[Killed] ArrayDeclaration
gleetchy/src/util/env.ts:35:8
     eventNames.reduce((acc: string[], name) => {
       if (isSupportedEvent(name)) acc.push(asEventName(name))
       return acc
-    }, []),
+    }, ["Stryker was here"]),
   )
 
