[Survived] BlockStatement
gleetchy/src/util/event.ts:1:46
-export const cancelEvent = (event: Event) => {
-  event.preventDefault()
-  event.stopPropagation()
-
-  return false
-}
+export const cancelEvent = (event: Event) => {}
 
 export const cancelReactEvent = <T extends { nativeEvent: Event }>(event: T) =>

[Survived] BooleanLiteral
gleetchy/src/util/event.ts:5:10
   event.preventDefault()
   event.stopPropagation()
 
-  return false
+  return true
 }
 

[Survived] ArrowFunction
gleetchy/src/util/event.ts:8:33
   return false
 }
 
-export const cancelReactEvent = <T extends { nativeEvent: Event }>(event: T) =>
-  cancelEvent(event.nativeEvent)
+export const cancelReactEvent = () => undefined
 
