[Survived] ArrowFunction
gleetchy/src/util/object.ts:3:31
 import { pick, isNil, pipe, not } from 'ramda'
 
-export const pickObjectKeys = (obj: { [key: string]: unknown }) =>
-  pick(Object.keys(obj))
+export const pickObjectKeys = () => undefined
 
 export const isNotNil = pipe(isNil, not)
