[Survived] ObjectLiteral
src/state/globalPlayback/reducer.ts:10:43
   isPlaying: boolean
 }
 
-const defaultState: GlobalPlaybackState = { isPlaying: false }
+const defaultState: GlobalPlaybackState = {}
 
 const globalPlaybackReducer: Reducer<

[Killed] ArrowFunction
src/state/globalPlayback/reducer.ts:15:5
 const globalPlaybackReducer: Reducer<
   GlobalPlaybackState,
   GlobalPlaybackAction
-> = (state = defaultState, action) =>
-  produce(state, draftState => {
-    switch (action.type) {
-      case 'GLOBAL_PLAYBACK_START':
-        draftState.isPlaying = true
-        break
-      case 'GLOBAL_PLAYBACK_STOP':
-        draftState.isPlaying = false
-        break
-      default:
-        break
-    }
-  })
+> = () => undefined
 
 export default globalPlaybackReducer

[Killed] BlockStatement
src/state/globalPlayback/reducer.ts:16:32
   GlobalPlaybackState,
   GlobalPlaybackAction
 > = (state = defaultState, action) =>
-  produce(state, draftState => {
-    switch (action.type) {
-      case 'GLOBAL_PLAYBACK_START':
-        draftState.isPlaying = true
-        break
-      case 'GLOBAL_PLAYBACK_STOP':
-        draftState.isPlaying = false
-        break
-      default:
-        break
-    }
-  })
+  produce(state, draftState => {})
 
 export default globalPlaybackReducer

[Killed] ConditionalExpression
src/state/globalPlayback/reducer.ts:18:7
 > = (state = defaultState, action) =>
   produce(state, draftState => {
     switch (action.type) {
-      case 'GLOBAL_PLAYBACK_START':
-        draftState.isPlaying = true
-        break
+      case 'GLOBAL_PLAYBACK_START':
       case 'GLOBAL_PLAYBACK_STOP':
         draftState.isPlaying = false

[Killed] StringLiteral
src/state/globalPlayback/reducer.ts:18:12
 > = (state = defaultState, action) =>
   produce(state, draftState => {
     switch (action.type) {
-      case 'GLOBAL_PLAYBACK_START':
+      case "":
         draftState.isPlaying = true
         break

[Killed] BooleanLiteral
src/state/globalPlayback/reducer.ts:19:32
   produce(state, draftState => {
     switch (action.type) {
       case 'GLOBAL_PLAYBACK_START':
-        draftState.isPlaying = true
+        draftState.isPlaying = false
         break
       case 'GLOBAL_PLAYBACK_STOP':

[Killed] ConditionalExpression
src/state/globalPlayback/reducer.ts:21:7
       case 'GLOBAL_PLAYBACK_START':
         draftState.isPlaying = true
         break
-      case 'GLOBAL_PLAYBACK_STOP':
-        draftState.isPlaying = false
-        break
+      case 'GLOBAL_PLAYBACK_STOP':
       default:
         break

[Killed] StringLiteral
src/state/globalPlayback/reducer.ts:21:12
       case 'GLOBAL_PLAYBACK_START':
         draftState.isPlaying = true
         break
-      case 'GLOBAL_PLAYBACK_STOP':
+      case "":
         draftState.isPlaying = false
         break

[Killed] BooleanLiteral
src/state/globalPlayback/reducer.ts:22:32
         draftState.isPlaying = true
         break
       case 'GLOBAL_PLAYBACK_STOP':
-        draftState.isPlaying = false
+        draftState.isPlaying = true
         break
       default:
