[Survived] ArrowFunction
src/state/ui/reducer.ts:16:47
   currentThemeName: defaultTheme.name,
 }
 
-const UIReducer: Reducer<UIState, UIAction> = (state = defaultState, action) =>
-  produce(state, draftState => {
-    switch (action.type) {
-      case 'UI_SET_THEME':
-        draftState.currentThemeName = action.payload
-        break
-      default:
-        break
-    }
-  })
+const UIReducer: Reducer<UIState, UIAction> = () => undefined
 
 export default UIReducer

[Survived] BlockStatement
src/state/ui/reducer.ts:17:32
 }
 
 const UIReducer: Reducer<UIState, UIAction> = (state = defaultState, action) =>
-  produce(state, draftState => {
-    switch (action.type) {
-      case 'UI_SET_THEME':
-        draftState.currentThemeName = action.payload
-        break
-      default:
-        break
-    }
-  })
+  produce(state, draftState => {})
 
 export default UIReducer

[Survived] ConditionalExpression
src/state/ui/reducer.ts:19:7
 const UIReducer: Reducer<UIState, UIAction> = (state = defaultState, action) =>
   produce(state, draftState => {
     switch (action.type) {
-      case 'UI_SET_THEME':
-        draftState.currentThemeName = action.payload
-        break
+      case 'UI_SET_THEME':
       default:
         break
