[Killed] ConditionalExpression
gleetchy/src/util/connection.ts:7:9
   function connect(node: AudioNode | AudioNodeConnectableProxy) {
     const outNode = getOutNode()
 
-    if (node instanceof AudioNode) {
+    if (true) {
       outNode.connect(node)
     } else if (typeof node.getInNode === 'function') {

[Killed] EqualityOperator
gleetchy/src/util/connection.ts:9:38
 
     if (node instanceof AudioNode) {
       outNode.connect(node)
-    } else if (typeof node.getInNode === 'function') {
+    } else if (typeof node.getInNode !== 'function') {
       outNode.connect(node.getInNode())
     } else {
