[Killed] ArrowFunction
gleetchy/src/util/object.ts:6:25
 export const pickObjectKeys = (obj: { [key: string]: unknown }) =>
   pick(Object.keys(obj))
 
-export const isNotNil = <T>(value: T): value is NonNullable<T> => !isNil(value)
+export const isNotNil = () => undefined
 

[Killed] BooleanLiteral
gleetchy/src/util/object.ts:6:67
 export const pickObjectKeys = (obj: { [key: string]: unknown }) =>
   pick(Object.keys(obj))
 
-export const isNotNil = <T>(value: T): value is NonNullable<T> => !isNil(value)
+export const isNotNil = <T>(value: T): value is NonNullable<T> => isNil(value)
 
